using System;
using System.Linq;
using DevExpress.ExpressApp;
using DevExpress.Data.Filtering;
using DevExpress.Persistent.Base;
using DevExpress.ExpressApp.Updating;
using DevExpress.ExpressApp.Security;
using DevExpress.ExpressApp.SystemModule;
using DevExpress.ExpressApp.Security.Strategy;
using DevExpress.Xpo;
using DevExpress.ExpressApp.Xpo;
using DevExpress.Persistent.BaseImpl;
using DevExpress.Persistent.BaseImpl.PermissionPolicy;
using pes.Module.BusinessObjects;
using System.Collections.Generic;

namespace pes.Module.DatabaseUpdate {
    // For more typical usage scenarios, be sure to check out https://documentation.devexpress.com/eXpressAppFramework/clsDevExpressExpressAppUpdatingModuleUpdatertopic.aspx
    public class Updater : ModuleUpdater {
        public Updater(IObjectSpace objectSpace, Version currentDBVersion) :
            base(objectSpace, currentDBVersion) {
        }
        public override void UpdateDatabaseAfterUpdateSchema() {
            base.UpdateDatabaseAfterUpdateSchema();

            if (ObjectSpace.GetObjectsCount(typeof(OpenSendScore), null) == 0)
            {
                ObjectSpace.CreateObject<OpenSendScore>();
            }

            PermissionPolicyRole defaultRole = CreateDefaultRole();
            PermissionPolicyRole dtaEntryRole = CreateDataEntryRole();
            PermissionPolicyRole auditRole = CreateAuditRole();

            //PermissionPolicyUser sampleUser = ObjectSpace.FindObject<PermissionPolicyUser>(new BinaryOperator("UserName", "User"));
            //if(sampleUser == null) {
            //    sampleUser = ObjectSpace.CreateObject<PermissionPolicyUser>();
            //    sampleUser.UserName = "User";
            //    sampleUser.SetPassword("");
            //}
            //sampleUser.Roles.Add(defaultRole);

            Dictionary<string, string> office = new Dictionary<string, string>()
            {

{"00000000","กรมสรรพากร"},
{"00001000","สำนักเลขานุการกรม"},
{"00002000","กองกฎหมาย"},
{"00003000","กองตรวจสอบภาษีกลาง"},
{"00004000","กองเทคโนโลยีสารสนเทศ"},
{"00005000","กองบริหารการคลังและรายได้"},
{"00006000","กองบริหารการเสียภาษีทางอิเล็กทรอนิกส์"},
{"00007000","กองบริหารทรัพยากรบุคคล"},
{"00008000","กองบริหารภาษีธุรกิจขนาดกลางและขนาดเล็ก"},
{"00009000","กองบริหารภาษีธุรกิจขนาดใหญ่"},
{"00010000","กองมาตรฐานการกำกับและตรวจสอบภาษี"},
{"00011000","กองมาตรฐานการจัดเก็บภาษี"},
{"00012000","กองมาตรฐานการสอบบัญชีภาษีอากร"},
{"00013000","กองวิชาการแผนภาษี"},
{"00014000","กองสำรวจและติดตามธุรกิจนอกระบบ"},
{"00015000","กองสืบสวนและคดี"},
{"00016000","กองอุทธรณ์ภาษี"},
{"00017000","กลุ่มงานตรวจสอบภายใน"},
{"00018000","กลุ่มบริหารการคืนภาษีมูลค่าเพิ่มให้แก่นักท่องเที่ยว"},
{"00019000","กลุ่มพัฒนาระบบบริหาร"},
{"00020000","งานตรวจราชการ 1"},
{"00021000","งานตรวจราชการ 2"},
{"00022000","งานตรวจราชการ 3"},
{"00023000","งานตรวจราชการ 4"},
{"00024000","งานตรวจราชการ 5"},
{"00025000","งานตรวจราชการ 6"},
{"00026000","ศูนย์สารนิเทศสรรพากร"},

{"01000000","สำนักงานสรรพากรภาค 1"},
{"01001000","สำนักงานสรรพากรพื้นที่กรุงเทพมหานคร 1"},
{"01001010","สำนักงานสรรพากรพื้นที่สาขาพระนคร 1"},
{"01001011","สำนักงานสรรพากรพื้นที่สาขาพระนคร 2"},
{"01002000","สำนักงานสรรพากรพื้นที่กรุงเทพมหานคร 2"},
{"01002080","สำนักงานสรรพากรพื้นที่สาขาป้อมปราบศัตรูพ่าย 1"},
{"01002081","สำนักงานสรรพากรพื้นที่สาขาป้อมปราบศัตรูพ่าย 2"},
{"01002130","สำนักงานสรรพากรพื้นที่สาขาสัมพันธวงศ์"},
{"01003000","สำนักงานสรรพากรพื้นที่กรุงเทพมหานคร 3"},
{"01003070","สำนักงานสรรพากรพื้นที่สาขาปทุมวัน 1"},
{"01003071","สำนักงานสรรพากรพื้นที่สาขาปทุมวัน 2"},
{"01004000","สำนักงานสรรพากรพื้นที่กรุงเทพมหานคร 4"},
{"01004140","สำนักงานสรรพากรพื้นที่สาขาพญาไท "},
{"01005000","สำนักงานสรรพากรพื้นที่กรุงเทพมหานคร 5"},
{"01005370","สำนักงานสรรพากรพื้นที่สาขาราชเทวี 1"},
{"01005371","สำนักงานสรรพากรพื้นที่สาขาราชเทวี 2"},
{"01006000","สำนักงานสรรพากรพื้นที่กรุงเทพมหานคร 6"},
{"01006020","สำนักงานสรรพากรพื้นที่สาขาดุสิต"},
{"01006290","สำนักงานสรรพากรพื้นที่สาขาบางซื่อ"},
{"01007000","สำนักงานสรรพากรพื้นที่กรุงเทพมหานคร 7"},
{"01007300","สำนักงานสรรพากรพื้นที่สาขาจตุจักร "},
{"01008000","สำนักงานสรรพากรพื้นที่กรุงเทพมหานคร 8"},
{"01008050","สำนักงานสรรพากรพื้นที่สาขาบางเขน"},
{"01008380","สำนักงานสรรพากรพื้นที่สาขาลาดพร้าว"},
{"01009000","สำนักงานสรรพากรพื้นที่กรุงเทพมหานคร 9"},
{"01009410","สำนักงานสรรพากรพื้นที่สาขาหลักสี่ "},
{"02000000","สำนักงานสรรพากรภาค 2"},
{"02010000","สำนักงานสรรพากรพื้นที่กรุงเทพมหานคร 10"},
{"02010170","สำนักงานสรรพากรพื้นที่สาขาห้วยขวาง 1"},
{"02010171","สำนักงานสรรพากรพื้นที่สาขาห้วยขวาง 2"},
{"02011000","สำนักงานสรรพากรพื้นที่กรุงเทพมหานคร 11"},
{"02011260","สำนักงานสรรพากรพื้นที่สาขาดินแดง"},
{"02012000","สำนักงานสรรพากรพื้นที่กรุงเทพมหานคร 12"},
{"02012340","สำนักงานสรรพากรพื้นที่สาขาสวนหลวง"},
{"02013000","สำนักงานสรรพากรพื้นที่กรุงเทพมหานคร 13"},
{"02013330","สำนักงานสรรพากรพื้นที่สาขาคลองเตย 1"},
{"02013331","สำนักงานสรรพากรพื้นที่สาขาคลองเตย 2"},
{"02014000","สำนักงานสรรพากรพื้นที่กรุงเทพมหานคร 14"},
{"02014390","สำนักงานสรรพากรพื้นที่สาขาวัฒนา "},
{"02015000","สำนักงานสรรพากรพื้นที่กรุงเทพมหานคร 15"},
{"02015090","สำนักงานสรรพากรพื้นที่สาขาพระโขนง "},
{"02016000","สำนักงานสรรพากรพื้นที่กรุงเทพมหานคร 16"},
{"02016320","สำนักงานสรรพากรพื้นที่สาขาประเวศ"},
{"02017000","สำนักงานสรรพากรพื้นที่กรุงเทพมหานคร 17"},
{"02017470","สำนักงานสรรพากรพื้นที่สาขาบางนา "},
{"02018000","สำนักงานสรรพากรพื้นที่กรุงเทพมหานคร 18"},
{"02018060","สำนักงานสรรพากรพื้นที่สาขาบางกะปิ "},
{"02019000","สำนักงานสรรพากรพื้นที่กรุงเทพมหานคร 19"},
{"02019270","สำนักงานสรรพากรพื้นที่สาขาบึงกุ่ม"},
{"02020000","สำนักงานสรรพากรพื้นที่กรุงเทพมหานคร 20"},
{"02020450","สำนักงานสรรพากรพื้นที่สาขาวังทองหลาง "},
{"02021000","สำนักงานสรรพากรพื้นที่กรุงเทพมหานคร 21"},
{"02021030","สำนักงานสรรพากรพื้นที่สาขาหนองจอก"},
{"02021100","สำนักงานสรรพากรพื้นที่สาขามีนบุรี"},
{"02021110","สำนักงานสรรพากรพื้นที่สาขาลาดกระบัง"},
{"03000000","สำนักงานสรรพากรภาค 3"},
{"03022000","สำนักงานสรรพากรพื้นที่กรุงเทพมหานคร 22"},
{"03022040","สำนักงานสรรพากรพื้นที่สาขาบางรัก 1"},
{"03022041","สำนักงานสรรพากรพื้นที่สาขาบางรัก 2"},
{"03022042","สำนักงานสรรพากรพื้นที่สาขาบางรัก 3"},
{"03023000","สำนักงานสรรพากรพื้นที่กรุงเทพมหานคร 23"},
{"03023120","สำนักงานสรรพากรพื้นที่สาขายานนาวา"},
{"03023310","สำนักงานสรรพากรพื้นที่สาขาบางคอแหลม"},
{"03024000","สำนักงานสรรพากรพื้นที่กรุงเทพมหานคร 24"},
{"03024280","สำนักงานสรรพากรพื้นที่สาขาสาทร"},
{"03025000","สำนักงานสรรพากรพื้นที่กรุงเทพมหานคร 25"},
{"03025190","สำนักงานสรรพากรพื้นที่สาขาตลิ่งชัน"},
{"03025250","สำนักงานสรรพากรพื้นที่สาขาบางพลัด"},
{"03026000","สำนักงานสรรพากรพื้นที่กรุงเทพมหานคร 26"},
{"03026220","สำนักงานสรรพากรพื้นที่สาขาภาษีเจริญ "},
{"03026230","สำนักงานสรรพากรพื้นที่สาขาหนองแขม"},
{"03026400","สำนักงานสรรพากรพื้นที่สาขาบางแค "},
{"03027000","สำนักงานสรรพากรพื้นที่กรุงเทพมหานคร 27"},
{"03027210","สำนักงานสรรพากรพื้นที่สาขาบางขุนเทียน"},
{"03027350","สำนักงานสรรพากรพื้นที่สาขาจอมทอง"},
{"03028000","สำนักงานสรรพากรพื้นที่กรุงเทพมหานคร 28"},
{"03028240","สำนักงานสรรพากรพื้นที่สาขาราษฎร์บูรณะ"},
{"03029000","สำนักงานสรรพากรพื้นที่กรุงเทพมหานคร 29"},
{"03029180","สำนักงานสรรพากรพื้นที่สาขาคลองสาน"},
{"03030000","สำนักงานสรรพากรพื้นที่กรุงเทพมหานคร 30"},
{"03030150","สำนักงานสรรพากรพื้นที่สาขาธนบุรี 1"},
{"03030151","สำนักงานสรรพากรพื้นที่สาขาธนบุรี 2"},
{"03030160","สำนักงานสรรพากรพื้นที่สาขาบางกอกใหญ่"},
{"03030200","สำนักงานสรรพากรพื้นที่สาขาบางกอกน้อย"},
{"04000000","สำนักงานสรรพากรภาค 4"},
{"04120000","สำนักงานสรรพากรพื้นที่นนทบุรี 1"},
{"04120010","สำนักงานสรรพากรพื้นที่สาขาเมืองนนทบุรี 1"},
{"04120011","สำนักงานสรรพากรพื้นที่สาขาเมืองนนทบุรี 2"},
{"04120060","สำนักงานสรรพากรพื้นที่สาขาปากเกร็ด 1"},
{"04120061","สำนักงานสรรพากรพื้นที่สาขาปากเกร็ด 2"},
{"04121000","สำนักงานสรรพากรพื้นที่นนทบุรี 2"},
{"04121020","สำนักงานสรรพากรพื้นที่สาขาบางกรวย"},
{"04121030","สำนักงานสรรพากรพื้นที่สาขาบางใหญ่"},
{"04121040","สำนักงานสรรพากรพื้นที่สาขาบางบัวทอง"},
{"04121050","สำนักงานสรรพากรพื้นที่สาขาไทรน้อย"},
{"04130000","สำนักงานสรรพากรพื้นที่ปทุมธานี 1"},
{"04130010","สำนักงานสรรพากรพื้นที่สาขาเมืองปทุมธานี"},
{"04130050","สำนักงานสรรพากรพื้นที่สาขาลาดหลุมแก้ว"},
{"04130070","สำนักงานสรรพากรพื้นที่สาขาสามโคก"},
{"04131000","สำนักงานสรรพากรพื้นที่ปทุมธานี 2"},
{"04131020","สำนักงานสรรพากรพื้นที่สาขาคลองหลวง 1"},
{"04131021","สำนักงานสรรพากรพื้นที่สาขาคลองหลวง 2"},
{"04131030","สำนักงานสรรพากรพื้นที่สาขาธัญบุรี"},
{"04131040","สำนักงานสรรพากรพื้นที่สาขาหนองเสือ"},
{"04131060","สำนักงานสรรพากรพื้นที่สาขาลำลูกกา"},
{"04140000","สำนักงานสรรพากรพื้นที่พระนครศรีอยุธยา 1"},
{"04140010","สำนักงานสรรพากรพื้นที่สาขาพระนครศรีอยุธยา"},
{"04140040","สำนักงานสรรพากรพื้นที่สาขาบางไทร"},
{"04140050","สำนักงานสรรพากรพื้นที่สาขาบางบาล"},
{"04140060","สำนักงานสรรพากรพื้นที่สาขาบางปะอิน"},
{"04140080","สำนักงานสรรพากรพื้นที่สาขาผักไห่"},
{"04140100","สำนักงานสรรพากรพื้นที่สาขาลาดบัวหลวง"},
{"04140110","สำนักงานสรรพากรพื้นที่สาขาวังน้อย"},
{"04140120","สำนักงานสรรพากรพื้นที่สาขาเสนา"},
{"04140130","สำนักงานสรรพากรพื้นที่สาขาบางซ้าย"},
{"04141000","สำนักงานสรรพากรพื้นที่พระนครศรีอยุธยา 2"},
{"04141020","สำนักงานสรรพากรพื้นที่สาขาท่าเรือ"},
{"04141030","สำนักงานสรรพากรพื้นที่สาขานครหลวง"},
{"04141070","สำนักงานสรรพากรพื้นที่สาขาบางปะหัน"},
{"04141090","สำนักงานสรรพากรพื้นที่สาขาภาชี"},
{"04141140","สำนักงานสรรพากรพื้นที่สาขาอุทัย"},
{"04141150","สำนักงานสรรพากรพื้นที่สาขามหาราช"},
{"04141160","สำนักงานสรรพากรพื้นที่สาขาบ้านแพรก"},
{"04150000","สำนักงานสรรพากรพื้นที่อ่างทอง"},
{"04150010","สำนักงานสรรพากรพื้นที่สาขาเมืองอ่างทอง"},
{"04150020","สำนักงานสรรพากรพื้นที่สาขาไชโย"},
{"04150030","สำนักงานสรรพากรพื้นที่สาขาป่าโมก"},
{"04150040","สำนักงานสรรพากรพื้นที่สาขาโพธิ์ทอง"},
{"04150050","สำนักงานสรรพากรพื้นที่สาขาแสวงหา"},
{"04150060","สำนักงานสรรพากรพื้นที่สาขาวิเศษชัยชาญ"},
{"04150070","สำนักงานสรรพากรพื้นที่สาขาสามโก้"},
{"04160000","สำนักงานสรรพากรพื้นที่ลพบุรี"},
{"04160010","สำนักงานสรรพากรพื้นที่สาขาเมืองลพบุรี"},
{"04160020","สำนักงานสรรพากรพื้นที่สาขาพัฒนานิคม"},
{"04160030","สำนักงานสรรพากรพื้นที่สาขาโคกสำโรง"},
{"04160040","สำนักงานสรรพากรพื้นที่สาขาชัยบาดาล"},
{"04160050","สำนักงานสรรพากรพื้นที่สาขาท่าวุ้ง"},
{"04160060","สำนักงานสรรพากรพื้นที่สาขาบ้านหมี่"},
{"04160070","สำนักงานสรรพากรพื้นที่สาขาท่าหลวง"},
{"04160080","สำนักงานสรรพากรพื้นที่สาขาสระโบสถ์"},
{"04160090","สำนักงานสรรพากรพื้นที่สาขาโคกเจริญ"},
{"04160100","สำนักงานสรรพากรพื้นที่สาขาลำสนธิ  "},
{"04160110","สำนักงานสรรพากรพื้นที่สาขาหนองม่วง "},
{"04170000","สำนักงานสรรพากรพื้นที่สิงห์บุรี"},
{"04170010","สำนักงานสรรพากรพื้นที่สาขาเมืองสิงห์บุรี"},
{"04170020","สำนักงานสรรพากรพื้นที่สาขาบางระจัน"},
{"04170030","สำนักงานสรรพากรพื้นที่สาขาค่ายบางระจัน"},
{"04170040","สำนักงานสรรพากรพื้นที่สาขาพรหมบุรี"},
{"04170050","สำนักงานสรรพากรพื้นที่สาขาท่าช้าง"},
{"04170060","สำนักงานสรรพากรพื้นที่สาขาอินทร์บุรี"},
{"04180000","สำนักงานสรรพากรพื้นที่ชัยนาท"},
{"04180010","สำนักงานสรรพากรพื้นที่สาขาเมืองชัยนาท"},
{"04180020","สำนักงานสรรพากรพื้นที่สาขามโนรมย์"},
{"04180030","สำนักงานสรรพากรพื้นที่สาขาวัดสิงห์"},
{"04180040","สำนักงานสรรพากรพื้นที่สาขาสรรพยา"},
{"04180050","สำนักงานสรรพากรพื้นที่สาขาสรรคบุรี"},
{"04180060","สำนักงานสรรพากรพื้นที่สาขาหันคา"},
{"04180070","สำนักงานสรรพากรพื้นที่สาขาหนองมะโมง"},
{"04190000","สำนักงานสรรพากรพื้นที่สระบุรี"},
{"04190010","สำนักงานสรรพากรพื้นที่สาขาเมืองสระบุรี"},
{"04190020","สำนักงานสรรพากรพื้นที่สาขาแก่งคอย"},
{"04190030","สำนักงานสรรพากรพื้นที่สาขาหนองแค"},
{"04190040","สำนักงานสรรพากรพื้นที่สาขาวิหารแดง"},
{"04190050","สำนักงานสรรพากรพื้นที่สาขาหนองแซง"},
{"04190060","สำนักงานสรรพากรพื้นที่สาขาบ้านหมอ"},
{"04190070","สำนักงานสรรพากรพื้นที่สาขาดอนพุด"},
{"04190080","สำนักงานสรรพากรพื้นที่สาขาหนองโดน"},
{"04190090","สำนักงานสรรพากรพื้นที่สาขาพระพุทธบาท"},
{"04190100","สำนักงานสรรพากรพื้นที่สาขาเสาไห้"},
{"04190110","สำนักงานสรรพากรพื้นที่สาขามวกเหล็ก"},
{"04190120","สำนักงานสรรพากรพื้นที่สาขาวังม่วง"},
{"04190130","สำนักงานสรรพากรพื้นที่สาขาเฉลิมพระเกียรติ (สบ.)"},
{"04610000","สำนักงานสรรพากรพื้นที่อุทัยธานี"},
{"04610010","สำนักงานสรรพากรพื้นที่สาขาเมืองอุทัยธานี"},
{"04610020","สำนักงานสรรพากรพื้นที่สาขาทัพทัน"},
{"04610030","สำนักงานสรรพากรพื้นที่สาขาสว่างอารมณ์"},
{"04610040","สำนักงานสรรพากรพื้นที่สาขาหนองฉาง"},
{"04610050","สำนักงานสรรพากรพื้นที่สาขาหนองขาหย่าง"},
{"04610060","สำนักงานสรรพากรพื้นที่สาขาบ้านไร่"},
{"04610070","สำนักงานสรรพากรพื้นที่สาขาลานสัก"},
{"04610080","สำนักงานสรรพากรพื้นที่สาขาห้วยคต"},
{"05000000","สำนักงานสรรพากรภาค 5"},
{"05110000","สำนักงานสรรพากรพื้นที่สมุทรปราการ 1"},
{"05110010","สำนักงานสรรพากรพื้นที่สาขาเมืองสมุทรปราการ 1"},
{"05110011","สำนักงานสรรพากรพื้นที่สาขาเมืองสมุทรปราการ 2"},
{"05111000","สำนักงานสรรพากรพื้นที่สมุทรปราการ 2"},
{"05111040","สำนักงานสรรพากรพื้นที่สาขาพระประแดง 1"},
{"05111041","สำนักงานสรรพากรพื้นที่สาขาพระประแดง 2"},
{"05111050","สำนักงานสรรพากรพื้นที่สาขาพระสมุทรเจดีย์"},
{"05112000","สำนักงานสรรพากรพื้นที่สมุทรปราการ 3"},
{"05112020","สำนักงานสรรพากรพื้นที่สาขาบางบ่อ"},
{"05112030","สำนักงานสรรพากรพื้นที่สาขาบางพลี"},
{"05112060","สำนักงานสรรพากรพื้นที่สาขาบางเสาธง"},
{"05200000","สำนักงานสรรพากรพื้นที่ชลบุรี 1"},
{"05200010","สำนักงานสรรพากรพื้นที่สาขาเมืองชลบุรี 1"},
{"05200011","สำนักงานสรรพากรพื้นที่สาขาเมืองชลบุรี 2"},
{"05200020","สำนักงานสรรพากรพื้นที่สาขาบ้านบึง"},
{"05200030","สำนักงานสรรพากรพื้นที่สาขาหนองใหญ่"},
{"05200050","สำนักงานสรรพากรพื้นที่สาขาพานทอง"},
{"05200060","สำนักงานสรรพากรพื้นที่สาขาพนัสนิคม"},
{"05200100","สำนักงานสรรพากรพื้นที่สาขาบ่อทอง"},
{"05200110","สำนักงานสรรพากรพื้นที่สาขาเกาะจันทร์"},
{"05201000","สำนักงานสรรพากรพื้นที่ชลบุรี 2"},
{"05201070","สำนักงานสรรพากรพื้นที่สาขาศรีราชา 1"},
{"05201071","สำนักงานสรรพากรพื้นที่สาขาศรีราชา 2"},
{"05201080","สำนักงานสรรพากรพื้นที่สาขาเกาะสีชัง"},
{"05202000","สำนักงานสรรพากรพื้นที่ชลบุรี 3"},
{"05202040","สำนักงานสรรพากรพื้นที่สาขาบางละมุง 1"},
{"05202041","สำนักงานสรรพากรพื้นที่สาขาบางละมุง 2"},
{"05202090","สำนักงานสรรพากรพื้นที่สาขาสัตหีบ "},
{"05210000","สำนักงานสรรพากรพื้นที่ระยอง"},
{"05210010","สำนักงานสรรพากรพื้นที่สาขาเมืองระยอง 1"},
{"05210011","สำนักงานสรรพากรพื้นที่สาขาเมืองระยอง 2"},
{"05210020","สำนักงานสรรพากรพื้นที่สาขาบ้านฉาง"},
{"05210030","สำนักงานสรรพากรพื้นที่สาขาแกลง"},
{"05210040","สำนักงานสรรพากรพื้นที่สาขาวังจันทร์"},
{"05210050","สำนักงานสรรพากรพื้นที่สาขาบ้านค่าย"},
{"05210060","สำนักงานสรรพากรพื้นที่สาขาปลวกแดง"},
{"05210070","สำนักงานสรรพากรพื้นที่สาขาเขาชะเมา"},
{"05210080","สำนักงานสรรพากรพื้นที่สาขานิคมพัฒนา"},
{"05220000","สำนักงานสรรพากรพื้นที่จันทบุรี"},
{"05220010","สำนักงานสรรพากรพื้นที่สาขาเมืองจันทบุรี"},
{"05220020","สำนักงานสรรพากรพื้นที่สาขาขลุง"},
{"05220030","สำนักงานสรรพากรพื้นที่สาขาท่าใหม่"},
{"05220040","สำนักงานสรรพากรพื้นที่สาขาโป่งน้ำร้อน"},
{"05220050","สำนักงานสรรพากรพื้นที่สาขามะขาม"},
{"05220060","สำนักงานสรรพากรพื้นที่สาขาแหลมสิงห์"},
{"05220070","สำนักงานสรรพากรพื้นที่สาขาสอยดาว"},
{"05220080","สำนักงานสรรพากรพื้นที่สาขาแก่งหางแมว"},
{"05220090","สำนักงานสรรพากรพื้นที่สาขานายายอาม  "},
{"05220100","สำนักงานสรรพากรพื้นที่สาขาเขาคิชฌกูฏ"},
{"05230000","สำนักงานสรรพากรพื้นที่ตราด"},
{"05230010","สำนักงานสรรพากรพื้นที่สาขาเมืองตราด"},
{"05230020","สำนักงานสรรพากรพื้นที่สาขาคลองใหญ่"},
{"05230030","สำนักงานสรรพากรพื้นที่สาขาเขาสมิง"},
{"05230040","สำนักงานสรรพากรพื้นที่สาขาบ่อไร่"},
{"05230050","สำนักงานสรรพากรพื้นที่สาขาแหลมงอบ"},
{"05230060","สำนักงานสรรพากรพื้นที่สาขาเกาะกูด"},
{"05230070","สำนักงานสรรพากรพื้นที่สาขาเกาะช้าง"},
{"05240000","สำนักงานสรรพากรพื้นที่ฉะเชิงเทรา"},
{"05240010","สำนักงานสรรพากรพื้นที่สาขาเมืองฉะเชิงเทรา"},
{"05240020","สำนักงานสรรพากรพื้นที่สาขาบางคล้า"},
{"05240030","สำนักงานสรรพากรพื้นที่สาขาบางน้ำเปรี้ยว"},
{"05240040","สำนักงานสรรพากรพื้นที่สาขาบางปะกง"},
{"05240050","สำนักงานสรรพากรพื้นที่สาขาบ้านโพธิ์"},
{"05240060","สำนักงานสรรพากรพื้นที่สาขาพนมสารคาม"},
{"05240070","สำนักงานสรรพากรพื้นที่สาขาราชสาส์น"},
{"05240080","สำนักงานสรรพากรพื้นที่สาขาสนามชัยเขต"},
{"05240090","สำนักงานสรรพากรพื้นที่สาขาแปลงยาว"},
{"05240100","สำนักงานสรรพากรพื้นที่สาขาท่าตะเกียบ "},
{"05240110","สำนักงานสรรพากรพื้นที่สาขาคลองเขื่อน"},
{"05250000","สำนักงานสรรพากรพื้นที่ปราจีนบุรี"},
{"05250010","สำนักงานสรรพากรพื้นที่สาขาเมืองปราจีนบุรี"},
{"05250020","สำนักงานสรรพากรพื้นที่สาขากบินทร์บุรี"},
{"05250030","สำนักงานสรรพากรพื้นที่สาขานาดี"},
{"05250060","สำนักงานสรรพากรพื้นที่สาขาบ้านสร้าง"},
{"05250070","สำนักงานสรรพากรพื้นที่สาขาประจันตคาม"},
{"05250080","สำนักงานสรรพากรพื้นที่สาขาศรีมหาโพธิ"},
{"05250090","สำนักงานสรรพากรพื้นที่สาขาศรีมโหสถ (โคกปีบ)"},
{"05260000","สำนักงานสรรพากรพื้นที่นครนายก"},
{"05260010","สำนักงานสรรพากรพื้นที่สาขาเมืองนครนายก"},
{"05260020","สำนักงานสรรพากรพื้นที่สาขาปากพลี"},
{"05260030","สำนักงานสรรพากรพื้นที่สาขาบ้านนา"},
{"05260040","สำนักงานสรรพากรพื้นที่สาขาองครักษ์"},
{"05270000","สำนักงานสรรพากรพื้นที่สระแก้ว"},
{"05270010","สำนักงานสรรพากรพื้นที่สาขาเมืองสระแก้ว"},
{"05270020","สำนักงานสรรพากรพื้นที่สาขาคลองหาด"},
{"05270030","สำนักงานสรรพากรพื้นที่สาขาตาพระยา"},
{"05270040","สำนักงานสรรพากรพื้นที่สาขาวังน้ำเย็น"},
{"05270050","สำนักงานสรรพากรพื้นที่สาขาวัฒนานคร"},
{"05270060","สำนักงานสรรพากรพื้นที่สาขาอรัญประเทศ"},
{"05270070","สำนักงานสรรพากรพื้นที่สาขาเขาฉกรรจ์"},
{"06000000","สำนักงานสรรพากรภาค 6"},
{"06700000","สำนักงานสรรพากรพื้นที่ราชบุรี"},
{"06700010","สำนักงานสรรพากรพื้นที่สาขาเมืองราชบุรี"},
{"06700020","สำนักงานสรรพากรพื้นที่สาขาจอมบึง"},
{"06700030","สำนักงานสรรพากรพื้นที่สาขาสวนผึ้ง"},
{"06700040","สำนักงานสรรพากรพื้นที่สาขาดำเนินสะดวก"},
{"06700050","สำนักงานสรรพากรพื้นที่สาขาบ้านโป่ง"},
{"06700060","สำนักงานสรรพากรพื้นที่สาขาบางแพ"},
{"06700070","สำนักงานสรรพากรพื้นที่สาขาโพธาราม"},
{"06700080","สำนักงานสรรพากรพื้นที่สาขาปากท่อ"},
{"06700090","สำนักงานสรรพากรพื้นที่สาขาวัดเพลง"},
{"06710000","สำนักงานสรรพากรพื้นที่กาญจนบุรี"},
{"06710010","สำนักงานสรรพากรพื้นที่สาขาเมืองกาญจนบุรี"},
{"06710020","สำนักงานสรรพากรพื้นที่สาขาไทรโยค"},
{"06710030","สำนักงานสรรพากรพื้นที่สาขาบ่อพลอย"},
{"06710040","สำนักงานสรรพากรพื้นที่สาขาศรีสวัสดิ์"},
{"06710050","สำนักงานสรรพากรพื้นที่สาขาท่ามะกา"},
{"06710060","สำนักงานสรรพากรพื้นที่สาขาท่าม่วง"},
{"06710070","สำนักงานสรรพากรพื้นที่สาขาทองผาภูมิ"},
{"06710080","สำนักงานสรรพากรพื้นที่สาขาสังขละบุรี"},
{"06710090","สำนักงานสรรพากรพื้นที่สาขาพนมทวน"},
{"06710100","สำนักงานสรรพากรพื้นที่สาขาเลาขวัญ"},
{"06710110","สำนักงานสรรพากรพื้นที่สาขาด่านมะขามเตี้ย"},
{"06710120","สำนักงานสรรพากรพื้นที่สาขาหนองปรือ "},
{"06710130","สำนักงานสรรพากรพื้นที่สาขาห้วยกระเจา"},
{"06720000","สำนักงานสรรพากรพื้นที่สุพรรณบุรี"},
{"06720010","สำนักงานสรรพากรพื้นที่สาขาเมืองสุพรรณบุรี"},
{"06720020","สำนักงานสรรพากรพื้นที่สาขาเดิมบางนางบวช"},
{"06720030","สำนักงานสรรพากรพื้นที่สาขาด่านช้าง"},
{"06720040","สำนักงานสรรพากรพื้นที่สาขาบางปลาม้า"},
{"06720050","สำนักงานสรรพากรพื้นที่สาขาศรีประจันต์"},
{"06720060","สำนักงานสรรพากรพื้นที่สาขาดอนเจดีย์"},
{"06720070","สำนักงานสรรพากรพื้นที่สาขาสองพี่น้อง"},
{"06720080","สำนักงานสรรพากรพื้นที่สาขาสามชุก"},
{"06720090","สำนักงานสรรพากรพื้นที่สาขาอู่ทอง"},
{"06720100","สำนักงานสรรพากรพื้นที่สาขาหนองหญ้าไซ"},
{"06730000","สำนักงานสรรพากรพื้นที่นครปฐม 1"},
{"06730010","สำนักงานสรรพากรพื้นที่สาขาเมืองนครปฐม"},
{"06730020","สำนักงานสรรพากรพื้นที่สาขากำแพงแสน"},
{"06730030","สำนักงานสรรพากรพื้นที่สาขานครชัยศรี"},
{"06730040","สำนักงานสรรพากรพื้นที่สาขาดอนตูม"},
{"06730050","สำนักงานสรรพากรพื้นที่สาขาบางเลน"},
{"06731000","สำนักงานสรรพากรพื้นที่นครปฐม 2"},
{"06731060","สำนักงานสรรพากรพื้นที่สาขาสามพราน 1"},
{"06731061","สำนักงานสรรพากรพื้นที่สาขาสามพราน 2"},
{"06731070","สำนักงานสรรพากรพื้นที่สาขาพุทธมณฑล "},
{"06740000","สำนักงานสรรพากรพื้นที่สมุทรสาคร 1"},
{"06740010","สำนักงานสรรพากรพื้นที่สาขาเมืองสมุทรสาคร 1"},
{"06740011","สำนักงานสรรพากรพื้นที่สาขาเมืองสมุทรสาคร 2"},
{"06741000","สำนักงานสรรพากรพื้นที่สมุทรสาคร 2"},
{"06741020","สำนักงานสรรพากรพื้นที่สาขากระทุ่มแบน 1"},
{"06741021","สำนักงานสรรพากรพื้นที่สาขากระทุ่มแบน 2"},
{"06741030","สำนักงานสรรพากรพื้นที่สาขาบ้านแพ้ว"},
{"06750000","สำนักงานสรรพากรพื้นที่สมุทรสงคราม"},
{"06750010","สำนักงานสรรพากรพื้นที่สาขาเมืองสมุทรสงคราม"},
{"06750020","สำนักงานสรรพากรพื้นที่สาขาบางคนที"},
{"06750030","สำนักงานสรรพากรพื้นที่สาขาอัมพวา"},
{"06760000","สำนักงานสรรพากรพื้นที่เพชรบุรี"},
{"06760010","สำนักงานสรรพากรพื้นที่สาขาเมืองเพชรบุรี"},
{"06760020","สำนักงานสรรพากรพื้นที่สาขาเขาย้อย"},
{"06760030","สำนักงานสรรพากรพื้นที่สาขาหนองหญ้าปล้อง"},
{"06760040","สำนักงานสรรพากรพื้นที่สาขาชะอำ"},
{"06760050","สำนักงานสรรพากรพื้นที่สาขาท่ายาง"},
{"06760060","สำนักงานสรรพากรพื้นที่สาขาบ้านลาด"},
{"06760070","สำนักงานสรรพากรพื้นที่สาขาบ้านแหลม"},
{"06760080","สำนักงานสรรพากรพื้นที่สาขาแก่งกระจาน"},
{"06770000","สำนักงานสรรพากรพื้นที่ประจวบคีรีขันธ์"},
{"06770010","สำนักงานสรรพากรพื้นที่สาขาเมืองประจวบคีรีขันธ์"},
{"06770020","สำนักงานสรรพากรพื้นที่สาขากุยบุรี"},
{"06770030","สำนักงานสรรพากรพื้นที่สาขาทับสะแก"},
{"06770040","สำนักงานสรรพากรพื้นที่สาขาบางสะพาน"},
{"06770050","สำนักงานสรรพากรพื้นที่สาขาบางสะพานน้อย"},
{"06770060","สำนักงานสรรพากรพื้นที่สาขาปราณบุรี"},
{"06770070","สำนักงานสรรพากรพื้นที่สาขาหัวหิน"},
{"06770080","สำนักงานสรรพากรพื้นที่สาขาสามร้อยยอด"},
{"07000000","สำนักงานสรรพากรภาค 7"},
{"07530000","สำนักงานสรรพากรพื้นที่อุตรดิตถ์"},
{"07530010","สำนักงานสรรพากรพื้นที่สาขาเมืองอุตรดิตถ์"},
{"07530020","สำนักงานสรรพากรพื้นที่สาขาตรอน"},
{"07530030","สำนักงานสรรพากรพื้นที่สาขาท่าปลา"},
{"07530040","สำนักงานสรรพากรพื้นที่สาขาน้ำปาด"},
{"07530050","สำนักงานสรรพากรพื้นที่สาขาฟากท่า"},
{"07530060","สำนักงานสรรพากรพื้นที่สาขาบ้านโคก"},
{"07530070","สำนักงานสรรพากรพื้นที่สาขาพิชัย"},
{"07530080","สำนักงานสรรพากรพื้นที่สาขาลับแล"},
{"07530090","สำนักงานสรรพากรพื้นที่สาขาทองแสนขัน"},
{"07600000","สำนักงานสรรพากรพื้นที่นครสวรรค์"},
{"07600010","สำนักงานสรรพากรพื้นที่สาขาเมืองนครสวรรค์"},
{"07600020","สำนักงานสรรพากรพื้นที่สาขาโกรกพระ"},
{"07600030","สำนักงานสรรพากรพื้นที่สาขาชุมแสง"},
{"07600040","สำนักงานสรรพากรพื้นที่สาขาหนองบัว"},
{"07600050","สำนักงานสรรพากรพื้นที่สาขาบรรพตพิสัย"},
{"07600060","สำนักงานสรรพากรพื้นที่สาขาเก้าเลี้ยว"},
{"07600070","สำนักงานสรรพากรพื้นที่สาขาตาคลี"},
{"07600080","สำนักงานสรรพากรพื้นที่สาขาท่าตะโก"},
{"07600090","สำนักงานสรรพากรพื้นที่สาขาไพศาลี"},
{"07600100","สำนักงานสรรพากรพื้นที่สาขาพยุหะคีรี"},
{"07600110","สำนักงานสรรพากรพื้นที่สาขาลาดยาว"},
{"07600120","สำนักงานสรรพากรพื้นที่สาขาตากฟ้า"},
{"07600130","สำนักงานสรรพากรพื้นที่สาขาแม่วงก์"},
{"07620000","สำนักงานสรรพากรพื้นที่กำแพงเพชร"},
{"07620010","สำนักงานสรรพากรพื้นที่สาขาเมืองกำแพงเพชร"},
{"07620020","สำนักงานสรรพากรพื้นที่สาขาไทรงาม"},
{"07620030","สำนักงานสรรพากรพื้นที่สาขาคลองลาน"},
{"07620040","สำนักงานสรรพากรพื้นที่สาขาขาณุวรลักษบุรี"},
{"07620050","สำนักงานสรรพากรพื้นที่สาขาคลองขลุง"},
{"07620060","สำนักงานสรรพากรพื้นที่สาขาพรานกระต่าย"},
{"07620070","สำนักงานสรรพากรพื้นที่สาขาลานกระบือ"},
{"07620100","สำนักงานสรรพากรพื้นที่สาขาบึงสามัคคี"},
{"07630000","สำนักงานสรรพากรพื้นที่ตาก "},
{"07630010","สำนักงานสรรพากรพื้นที่สาขาเมืองตาก"},
{"07630020","สำนักงานสรรพากรพื้นที่สาขาบ้านตาก"},
{"07630030","สำนักงานสรรพากรพื้นที่สาขาสามเงา"},
{"07630040","สำนักงานสรรพากรพื้นที่สาขาแม่ระมาด"},
{"07630050","สำนักงานสรรพากรพื้นที่สาขาท่าสองยาง"},
{"07630060","สำนักงานสรรพากรพื้นที่สาขาแม่สอด"},
{"07630070","สำนักงานสรรพากรพื้นที่สาขาพบพระ"},
{"07630080","สำนักงานสรรพากรพื้นที่สาขาอุ้มผาง"},
{"07630090","สำนักงานสรรพากรพื้นที่สาขาวังเจ้า"},
{"07640000","สำนักงานสรรพากรพื้นที่สุโขทัย"},
{"07640010","สำนักงานสรรพากรพื้นที่สาขาเมืองสุโขทัย"},
{"07640020","สำนักงานสรรพากรพื้นที่สาขาบ้านด่านลานหอย"},
{"07640030","สำนักงานสรรพากรพื้นที่สาขาคีรีมาศ"},
{"07640040","สำนักงานสรรพากรพื้นที่สาขากงไกรลาศ"},
{"07640050","สำนักงานสรรพากรพื้นที่สาขาศรีสัชนาลัย"},
{"07640060","สำนักงานสรรพากรพื้นที่สาขาศรีสำโรง"},
{"07640070","สำนักงานสรรพากรพื้นที่สาขาสวรรคโลก"},
{"07640080","สำนักงานสรรพากรพื้นที่สาขาศรีนคร"},
{"07640090","สำนักงานสรรพากรพื้นที่สาขาทุ่งเสลี่ยม"},
{"07650000","สำนักงานสรรพากรพื้นที่พิษณุโลก"},
{"07650010","สำนักงานสรรพากรพื้นที่สาขาเมืองพิษณุโลก"},
{"07650020","สำนักงานสรรพากรพื้นที่สาขานครไทย"},
{"07650030","สำนักงานสรรพากรพื้นที่สาขาชาติตระการ"},
{"07650040","สำนักงานสรรพากรพื้นที่สาขาบางระกำ"},
{"07650050","สำนักงานสรรพากรพื้นที่สาขาบางกระทุ่ม"},
{"07650060","สำนักงานสรรพากรพื้นที่สาขาพรหมพิราม"},
{"07650070","สำนักงานสรรพากรพื้นที่สาขาวัดโบสถ์"},
{"07650080","สำนักงานสรรพากรพื้นที่สาขาวังทอง"},
{"07650090","สำนักงานสรรพากรพื้นที่สาขาเนินมะปราง"},
{"07660000","สำนักงานสรรพากรพื้นที่พิจิตร"},
{"07660010","สำนักงานสรรพากรพื้นที่สาขาเมืองพิจิตร"},
{"07660020","สำนักงานสรรพากรพื้นที่สาขาวังทรายพูน"},
{"07660030","สำนักงานสรรพากรพื้นที่สาขาโพธิ์ประทับช้าง"},
{"07660040","สำนักงานสรรพากรพื้นที่สาขาตะพานหิน"},
{"07660050","สำนักงานสรรพากรพื้นที่สาขาบางมูลนาก"},
{"07660060","สำนักงานสรรพากรพื้นที่สาขาโพทะเล"},
{"07660070","สำนักงานสรรพากรพื้นที่สาขาสามง่าม"},
{"07660080","สำนักงานสรรพากรพื้นที่สาขาทับคล้อ"},
{"07660090","สำนักงานสรรพากรพื้นที่สาขาสากเหล็ก"},
{"07670000","สำนักงานสรรพากรพื้นที่เพชรบูรณ์"},
{"07670010","สำนักงานสรรพากรพื้นที่สาขาเมืองเพชรบูรณ์"},
{"07670020","สำนักงานสรรพากรพื้นที่สาขาชนแดน"},
{"07670030","สำนักงานสรรพากรพื้นที่สาขาหล่มสัก"},
{"07670040","สำนักงานสรรพากรพื้นที่สาขาหล่มเก่า"},
{"07670050","สำนักงานสรรพากรพื้นที่สาขาวิเชียรบุรี"},
{"07670060","สำนักงานสรรพากรพื้นที่สาขาศรีเทพ"},
{"07670070","สำนักงานสรรพากรพื้นที่สาขาหนองไผ่"},
{"07670080","สำนักงานสรรพากรพื้นที่สาขาบึงสามพัน"},
{"07670090","สำนักงานสรรพากรพื้นที่สาขาน้ำหนาว"},
{"07670100","สำนักงานสรรพากรพื้นที่สาขาวังโป่ง"},
{"07670110","สำนักงานสรรพากรพื้นที่สาขาเขาค้อ"},
{"08000000","สำนักงานสรรพากรภาค 8"},
{"08500000","สำนักงานสรรพากรพื้นที่เชียงใหม่ 1"},
{"08500010","สำนักงานสรรพากรพื้นที่สาขาเมืองเชียงใหม่ 1"},
{"08500011","สำนักงานสรรพากรพื้นที่สาขาเมืองเชียงใหม่ 2"},
{"08500020","สำนักงานสรรพากรพื้นที่สาขาจอมทอง"},
{"08500030","สำนักงานสรรพากรพื้นที่สาขาแม่แจ่ม"},
{"08500080","สำนักงานสรรพากรพื้นที่สาขาสะเมิง"},
{"08500120","สำนักงานสรรพากรพื้นที่สาขาสันป่าตอง"},
{"08500150","สำนักงานสรรพากรพื้นที่สาขาหางดง"},
{"08500160","สำนักงานสรรพากรพื้นที่สาขาฮอด"},
{"08500170","สำนักงานสรรพากรพื้นที่สาขาดอยเต่า"},
{"08500180","สำนักงานสรรพากรพื้นที่สาขาอมก๋อย"},
{"08500190","สำนักงานสรรพากรพื้นที่สาขาสารภี"},
{"08500240","สำนักงานสรรพากรพื้นที่สาขาดอยหล่อ"},
{"08501000","สำนักงานสรรพากรพื้นที่เชียงใหม่ 2"},
{"08501040","สำนักงานสรรพากรพื้นที่สาขาเชียงดาว"},
{"08501050","สำนักงานสรรพากรพื้นที่สาขาดอยสะเก็ด"},
{"08501060","สำนักงานสรรพากรพื้นที่สาขาแม่แตง"},
{"08501070","สำนักงานสรรพากรพื้นที่สาขาแม่ริม"},
{"08501090","สำนักงานสรรพากรพื้นที่สาขาฝาง"},
{"08501100","สำนักงานสรรพากรพื้นที่สาขาแม่อาย"},
{"08501110","สำนักงานสรรพากรพื้นที่สาขาพร้าว"},
{"08501130","สำนักงานสรรพากรพื้นที่สาขาสันกำแพง"},
{"08501140","สำนักงานสรรพากรพื้นที่สาขาสันทราย"},
{"08501200","สำนักงานสรรพากรพื้นที่สาขาเวียงแหง"},
{"08501210","สำนักงานสรรพากรพื้นที่สาขาไชยปราการ"},
{"08510000","สำนักงานสรรพากรพื้นที่ลำพูน"},
{"08510010","สำนักงานสรรพากรพื้นที่สาขาเมืองลำพูน"},
{"08510020","สำนักงานสรรพากรพื้นที่สาขาแม่ทา"},
{"08510030","สำนักงานสรรพากรพื้นที่สาขาบ้านโฮ่ง"},
{"08510040","สำนักงานสรรพากรพื้นที่สาขาลี้"},
{"08510050","สำนักงานสรรพากรพื้นที่สาขาทุ่งหัวช้าง"},
{"08510060","สำนักงานสรรพากรพื้นที่สาขาป่าซาง"},
{"08510070","สำนักงานสรรพากรพื้นที่สาขาบ้านธิ"},
{"08510080","สำนักงานสรรพากรพื้นที่สาขาเวียงหนองล่อง"},
{"08520000","สำนักงานสรรพากรพื้นที่ลำปาง"},
{"08520010","สำนักงานสรรพากรพื้นที่สาขาเมืองลำปาง"},
{"08520020","สำนักงานสรรพากรพื้นที่สาขาแม่เมาะ"},
{"08520030","สำนักงานสรรพากรพื้นที่สาขาเกาะคา"},
{"08520050","สำนักงานสรรพากรพื้นที่สาขางาว"},
{"08520060","สำนักงานสรรพากรพื้นที่สาขาแจ้ห่ม"},
{"08520070","สำนักงานสรรพากรพื้นที่สาขาวังเหนือ"},
{"08520080","สำนักงานสรรพากรพื้นที่สาขาเถิน"},
{"08520090","สำนักงานสรรพากรพื้นที่สาขาแม่พริก"},
{"08520100","สำนักงานสรรพากรพื้นที่สาขาแม่ทะ"},
{"08520110","สำนักงานสรรพากรพื้นที่สาขาสบปราบ"},
{"08520120","สำนักงานสรรพากรพื้นที่สาขาห้างฉัตร"},
{"08540000","สำนักงานสรรพากรพื้นที่แพร่"},
{"08540010","สำนักงานสรรพากรพื้นที่สาขาเมืองแพร่"},
{"08540020","สำนักงานสรรพากรพื้นที่สาขาร้องกวาง"},
{"08540030","สำนักงานสรรพากรพื้นที่สาขาลอง"},
{"08540040","สำนักงานสรรพากรพื้นที่สาขาสูงเม่น"},
{"08540050","สำนักงานสรรพากรพื้นที่สาขาเด่นชัย"},
{"08540060","สำนักงานสรรพากรพื้นที่สาขาสอง"},
{"08540070","สำนักงานสรรพากรพื้นที่สาขาวังชิ้น"},
{"08540080","สำนักงานสรรพากรพื้นที่สาขาหนองม่วงไข่"},
{"08550000","สำนักงานสรรพากรพื้นที่น่าน"},
{"08550010","สำนักงานสรรพากรพื้นที่สาขาเมืองน่าน"},
{"08550020","สำนักงานสรรพากรพื้นที่สาขาแม่จริม"},
{"08550030","สำนักงานสรรพากรพื้นที่สาขาบ้านหลวง"},
{"08550040","สำนักงานสรรพากรพื้นที่สาขานาน้อย"},
{"08550050","สำนักงานสรรพากรพื้นที่สาขาปัว"},
{"08550060","สำนักงานสรรพากรพื้นที่สาขาท่าวังผา"},
{"08550070","สำนักงานสรรพากรพื้นที่สาขาเวียงสา"},
{"08550080","สำนักงานสรรพากรพื้นที่สาขาทุ่งช้าง"},
{"08550090","สำนักงานสรรพากรพื้นที่สาขาเชียงกลาง"},
{"08550100","สำนักงานสรรพากรพื้นที่สาขานาหมื่น"},
{"08550120","สำนักงานสรรพากรพื้นที่สาขาบ่อเกลือ"},
{"08560000","สำนักงานสรรพากรพื้นที่พะเยา"},
{"08560010","สำนักงานสรรพากรพื้นที่สาขาเมืองพะเยา"},
{"08560020","สำนักงานสรรพากรพื้นที่สาขาจุน"},
{"08560030","สำนักงานสรรพากรพื้นที่สาขาเชียงคำ"},
{"08560040","สำนักงานสรรพากรพื้นที่สาขาเชียงม่วน"},
{"08560050","สำนักงานสรรพากรพื้นที่สาขาดอกคำใต้"},
{"08560060","สำนักงานสรรพากรพื้นที่สาขาปง"},
{"08560070","สำนักงานสรรพากรพื้นที่สาขาแม่ใจ"},
{"08560080","สำนักงานสรรพากรพื้นที่สาขาภูซาง"},
{"08570000","สำนักงานสรรพากรพื้นที่เชียงราย"},
{"08570010","สำนักงานสรรพากรพื้นที่สาขาเมืองเชียงราย"},
{"08570020","สำนักงานสรรพากรพื้นที่สาขาเวียงชัย"},
{"08570030","สำนักงานสรรพากรพื้นที่สาขาเชียงของ"},
{"08570040","สำนักงานสรรพากรพื้นที่สาขาเทิง"},
{"08570050","สำนักงานสรรพากรพื้นที่สาขาพาน"},
{"08570060","สำนักงานสรรพากรพื้นที่สาขาป่าแดด"},
{"08570070","สำนักงานสรรพากรพื้นที่สาขาแม่จัน"},
{"08570080","สำนักงานสรรพากรพื้นที่สาขาเชียงแสน"},
{"08570090","สำนักงานสรรพากรพื้นที่สาขาแม่สาย"},
{"08570100","สำนักงานสรรพากรพื้นที่สาขาแม่สรวย"},
{"08570110","สำนักงานสรรพากรพื้นที่สาขาเวียงป่าเป้า"},
{"08570120","สำนักงานสรรพากรพื้นที่สาขาพญาเม็งราย"},
{"08570130","สำนักงานสรรพากรพื้นที่สาขาเวียงแก่น"},
{"08570140","สำนักงานสรรพากรพื้นที่สาขาขุนตาล "},
{"08570150","สำนักงานสรรพากรพื้นที่สาขาแม่ฟ้าหลวง "},
{"08570160","สำนักงานสรรพากรพื้นที่สาขาแม่ลาว"},
{"08580000","สำนักงานสรรพากรพื้นที่แม่ฮ่องสอน"},
{"08580010","สำนักงานสรรพากรพื้นที่สาขาเมืองแม่ฮ่องสอน"},
{"08580020","สำนักงานสรรพากรพื้นที่สาขาขุนยวม"},
{"08580030","สำนักงานสรรพากรพื้นที่สาขาปาย"},
{"08580040","สำนักงานสรรพากรพื้นที่สาขาแม่สะเรียง"},
{"08580050","สำนักงานสรรพากรพื้นที่สาขาแม่ลาน้อย"},
{"08580060","สำนักงานสรรพากรพื้นที่สาขาสบเมย"},
{"09000000","สำนักงานสรรพากรภาค 9"},
{"09300000","สำนักงานสรรพากรพื้นที่นครราชสีมา 1"},
{"09300010","สำนักงานสรรพากรพื้นที่สาขาเมืองนครราชสีมา 1"},
{"09300011","สำนักงานสรรพากรพื้นที่สาขาเมืองนครราชสีมา 2"},
{"09300030","สำนักงานสรรพากรพื้นที่สาขาเสิงสาง"},
{"09300040","สำนักงานสรรพากรพื้นที่สาขาคง"},
{"09300050","สำนักงานสรรพากรพื้นที่สาขาบ้านเหลื่อม"},
{"09300060","สำนักงานสรรพากรพื้นที่สาขาจักราช"},
{"09300090","สำนักงานสรรพากรพื้นที่สาขาโนนไทย"},
{"09300100","สำนักงานสรรพากรพื้นที่สาขาโนนสูง"},
{"09300110","สำนักงานสรรพากรพื้นที่สาขาขามสะแกแสง"},
{"09300120","สำนักงานสรรพากรพื้นที่สาขาบัวใหญ่"},
{"09300130","สำนักงานสรรพากรพื้นที่สาขาประทาย"},
{"09300150","สำนักงานสรรพากรพื้นที่สาขาพิมาย"},
{"09300160","สำนักงานสรรพากรพื้นที่สาขาห้วยแถลง"},
{"09300170","สำนักงานสรรพากรพื้นที่สาขาชุมพวง"},
{"09300190","สำนักงานสรรพากรพื้นที่สาขาขามทะเลสอ"},
{"09300220","สำนักงานสรรพากรพื้นที่สาขาหนองบุญมาก"},
{"09300230","สำนักงานสรรพากรพื้นที่สาขาแก้งสนามนาง"},
{"09300280","สำนักงานสรรพากรพื้นที่สาขาพระทองคำ"},
{"09300320","สำนักงานสรรพากรพื้นที่สาขาเฉลิมพระเกียรติ (นส.)"},
{"09301000","สำนักงานสรรพากรพื้นที่นครราชสีมา 2"},
{"09301020","สำนักงานสรรพากรพื้นที่สาขาครบุรี"},
{"09301070","สำนักงานสรรพากรพื้นที่สาขาโชคชัย"},
{"09301080","สำนักงานสรรพากรพื้นที่สาขาด่านขุนทด"},
{"09301140","สำนักงานสรรพากรพื้นที่สาขาปักธงชัย"},
{"09301180","สำนักงานสรรพากรพื้นที่สาขาสูงเนิน"},
{"09301200","สำนักงานสรรพากรพื้นที่สาขาสีคิ้ว"},
{"09301210","สำนักงานสรรพากรพื้นที่สาขาปากช่อง"},
{"09301250","สำนักงานสรรพากรพื้นที่สาขาวังน้ำเขียว "},
{"09310000","สำนักงานสรรพากรพื้นที่บุรีรัมย์"},
{"09310010","สำนักงานสรรพากรพื้นที่สาขาเมืองบุรีรัมย์"},
{"09310020","สำนักงานสรรพากรพื้นที่สาขาคูเมือง"},
{"09310030","สำนักงานสรรพากรพื้นที่สาขากระสัง"},
{"09310040","สำนักงานสรรพากรพื้นที่สาขานางรอง"},
{"09310050","สำนักงานสรรพากรพื้นที่สาขาหนองกี่"},
{"09310060","สำนักงานสรรพากรพื้นที่สาขาละหานทราย"},
{"09310070","สำนักงานสรรพากรพื้นที่สาขาประโคนชัย"},
{"09310080","สำนักงานสรรพากรพื้นที่สาขาบ้านกรวด"},
{"09310090","สำนักงานสรรพากรพื้นที่สาขาพุทไธสง"},
{"09310100","สำนักงานสรรพากรพื้นที่สาขาลำปลายมาศ"},
{"09310110","สำนักงานสรรพากรพื้นที่สาขาสตึก"},
{"09310120","สำนักงานสรรพากรพื้นที่สาขาปะคำ"},
{"09310130","สำนักงานสรรพากรพื้นที่สาขานาโพธิ์"},
{"09310140","สำนักงานสรรพากรพื้นที่สาขาหนองหงส์"},
{"09310160","สำนักงานสรรพากรพื้นที่สาขาห้วยราช"},
{"09310180","สำนักงานสรรพากรพื้นที่สาขาชำนิ  "},
{"09310190","สำนักงานสรรพากรพื้นที่สาขาบ้านใหม่ไชยพจน์ "},
{"09310200","สำนักงานสรรพากรพื้นที่สาขาโนนดินแดง "},
{"09310230","สำนักงานสรรพากรพื้นที่สาขาเฉลิมพระเกียรติ (บร.)"},
{"09320000","สำนักงานสรรพากรพื้นที่สุรินทร์"},
{"09320010","สำนักงานสรรพากรพื้นที่สาขาเมืองสุรินทร์"},
{"09320020","สำนักงานสรรพากรพื้นที่สาขาชุมพลบุรี"},
{"09320030","สำนักงานสรรพากรพื้นที่สาขาท่าตูม"},
{"09320040","สำนักงานสรรพากรพื้นที่สาขาจอมพระ"},
{"09320050","สำนักงานสรรพากรพื้นที่สาขาปราสาท"},
{"09320060","สำนักงานสรรพากรพื้นที่สาขากาบเชิง"},
{"09320070","สำนักงานสรรพากรพื้นที่สาขารัตนบุรี"},
{"09320080","สำนักงานสรรพากรพื้นที่สาขาสนม"},
{"09320090","สำนักงานสรรพากรพื้นที่สาขาศีขรภูมิ"},
{"09320100","สำนักงานสรรพากรพื้นที่สาขาสังขะ"},
{"09320110","สำนักงานสรรพากรพื้นที่สาขาลำดวน"},
{"09320120","สำนักงานสรรพากรพื้นที่สาขาสำโรงทาบ"},
{"09330000","สำนักงานสรรพากรพื้นที่ศรีสะเกษ"},
{"09330010","สำนักงานสรรพากรพื้นที่สาขาเมืองศรีสะเกษ"},
{"09330020","สำนักงานสรรพากรพื้นที่สาขายางชุมน้อย"},
{"09330030","สำนักงานสรรพากรพื้นที่สาขากันทรารมย์"},
{"09330040","สำนักงานสรรพากรพื้นที่สาขากันทรลักษ์"},
{"09330050","สำนักงานสรรพากรพื้นที่สาขาขุขันธ์"},
{"09330060","สำนักงานสรรพากรพื้นที่สาขาไพรบึง"},
{"09330070","สำนักงานสรรพากรพื้นที่สาขาปรางค์กู่"},
{"09330080","สำนักงานสรรพากรพื้นที่สาขาขุนหาญ"},
{"09330090","สำนักงานสรรพากรพื้นที่สาขาราษีไศล"},
{"09330100","สำนักงานสรรพากรพื้นที่สาขาอุทุมพรพิสัย"},
{"09330110","สำนักงานสรรพากรพื้นที่สาขาบึงบูรพ์"},
{"09330120","สำนักงานสรรพากรพื้นที่สาขาห้วยทับทัน"},
{"09330130","สำนักงานสรรพากรพื้นที่สาขาโนนคูณ"},
{"09330140","สำนักงานสรรพากรพื้นที่สาขาศรีรัตนะ"},
{"09330150","สำนักงานสรรพากรพื้นที่สาขาน้ำเกลี้ยง"},
{"09330160","สำนักงานสรรพากรพื้นที่สาขาวังหิน"},
{"09330170","สำนักงานสรรพากรพื้นที่สาขาภูสิงห์"},
{"09330200","สำนักงานสรรพากรพื้นที่สาขาพยุห์"},
{"09340000","สำนักงานสรรพากรพื้นที่อุบลราชธานี"},
{"09340010","สำนักงานสรรพากรพื้นที่สาขาเมืองอุบลราชธานี"},
{"09340020","สำนักงานสรรพากรพื้นที่สาขาศรีเมืองใหม่ "},
{"09340030","สำนักงานสรรพากรพื้นที่สาขาโขงเจียม"},
{"09340040","สำนักงานสรรพากรพื้นที่สาขาเขื่องใน"},
{"09340050","สำนักงานสรรพากรพื้นที่สาขาเขมราฐ"},
{"09340070","สำนักงานสรรพากรพื้นที่สาขาเดชอุดม"},
{"09340080","สำนักงานสรรพากรพื้นที่สาขานาจะหลวย"},
{"09340090","สำนักงานสรรพากรพื้นที่สาขาน้ำยืน"},
{"09340100","สำนักงานสรรพากรพื้นที่สาขาบุณฑริก"},
{"09340110","สำนักงานสรรพากรพื้นที่สาขาตระการพืชผล"},
{"09340120","สำนักงานสรรพากรพื้นที่สาขากุดข้าวปุ้น"},
{"09340140","สำนักงานสรรพากรพื้นที่สาขาม่วงสามสิบ"},
{"09340150","สำนักงานสรรพากรพื้นที่สาขาวารินชำราบ"},
{"09340190","สำนักงานสรรพากรพื้นที่สาขาพิบูลมังสาหาร"},
{"09340200","สำนักงานสรรพากรพื้นที่สาขาตาลสุม"},
{"09340210","สำนักงานสรรพากรพื้นที่สาขาโพธิ์ไทร"},
{"09340220","สำนักงานสรรพากรพื้นที่สาขาสำโรง"},
{"09340240","สำนักงานสรรพากรพื้นที่สาขาดอนมดแดง "},
{"09340250","สำนักงานสรรพากรพื้นที่สาขาสิรินธร"},
{"09340310","สำนักงานสรรพากรพื้นที่สาขาเหล่าเสือโก้ก"},
{"09340320","สำนักงานสรรพากรพื้นที่สาขาสว่างวีระวงศ์"},
{"09350000","สำนักงานสรรพากรพื้นที่ยโสธร"},
{"09350010","สำนักงานสรรพากรพื้นที่สาขาเมืองยโสธร"},
{"09350030","สำนักงานสรรพากรพื้นที่สาขากุดชุม"},
{"09350040","สำนักงานสรรพากรพื้นที่สาขาคำเขื่อนแก้ว"},
{"09350050","สำนักงานสรรพากรพื้นที่สาขาป่าติ้ว"},
{"09350060","สำนักงานสรรพากรพื้นที่สาขามหาชนะชัย"},
{"09350070","สำนักงานสรรพากรพื้นที่สาขาค้อวัง"},
{"09350080","สำนักงานสรรพากรพื้นที่สาขาเลิงนกทา"},
{"09360000","สำนักงานสรรพากรพื้นที่ชัยภูมิ"},
{"09360010","สำนักงานสรรพากรพื้นที่สาขาเมืองชัยภูมิ"},
{"09360020","สำนักงานสรรพากรพื้นที่สาขาบ้านเขว้า"},
{"09360030","สำนักงานสรรพากรพื้นที่สาขาคอนสวรรค์"},
{"09360040","สำนักงานสรรพากรพื้นที่สาขาเกษตรสมบูรณ์"},
{"09360050","สำนักงานสรรพากรพื้นที่สาขาหนองบัวแดง"},
{"09360060","สำนักงานสรรพากรพื้นที่สาขาจัตุรัส"},
{"09360070","สำนักงานสรรพากรพื้นที่สาขาบำเหน็จณรงค์"},
{"09360080","สำนักงานสรรพากรพื้นที่สาขาหนองบัวระเหว"},
{"09360090","สำนักงานสรรพากรพื้นที่สาขาเทพสถิต"},
{"09360100","สำนักงานสรรพากรพื้นที่สาขาภูเขียว"},
{"09360110","สำนักงานสรรพากรพื้นที่สาขาบ้านแท่น"},
{"09360120","สำนักงานสรรพากรพื้นที่สาขาแก้งคร้อ"},
{"09360130","สำนักงานสรรพากรพื้นที่สาขาคอนสาร"},
{"09370000","สำนักงานสรรพากรพื้นที่อำนาจเจริญ"},
{"09370010","สำนักงานสรรพากรพื้นที่สาขาเมืองอำนาจเจริญ"},
{"09370030","สำนักงานสรรพากรพื้นที่สาขาปทุมราชวงศา"},
{"09370050","สำนักงานสรรพากรพื้นที่สาขาเสนางคนิคม"},
{"09370060","สำนักงานสรรพากรพื้นที่สาขาหัวตะพาน"},
{"09370070","สำนักงานสรรพากรพื้นที่สาขาลืออำนาจ  "},
{"10000000","สำนักงานสรรพากรภาค 10"},
{"10380000","สำนักงานสรรพากรพื้นที่บึงกาฬ"},
{"10380010","สำนักงานสรรพากรพื้นที่สาขาเมืองบึงกาฬ"},
{"10380020","สำนักงานสรรพากรพื้นที่สาขาพรเจริญ"},
{"10380030","สำนักงานสรรพากรพื้นที่สาขาโซ่พิสัย"},
{"10380040","สำนักงานสรรพากรพื้นที่สาขาเซกา"},
{"10380050","สำนักงานสรรพากรพื้นที่สาขาปากคาด"},
{"10380060","สำนักงานสรรพากรพื้นที่สาขาบึงโขงหลง"},
{"10380070","สำนักงานสรรพากรพื้นที่สาขาศรีวิไล"},
{"10390000","สำนักงานสรรพากรพื้นที่หนองบัวลำภู"},
{"10390010","สำนักงานสรรพากรพื้นที่สาขาเมืองหนองบัวลำภู"},
{"10390020","สำนักงานสรรพากรพื้นที่สาขานากลาง"},
{"10390030","สำนักงานสรรพากรพื้นที่สาขาโนนสัง"},
{"10390040","สำนักงานสรรพากรพื้นที่สาขาศรีบุญเรือง"},
{"10390050","สำนักงานสรรพากรพื้นที่สาขาสุวรรณคูหา"},
{"10390060","สำนักงานสรรพากรพื้นที่สาขานาวัง"},
{"10400000","สำนักงานสรรพากรพื้นที่ขอนแก่น"},
{"10400010","สำนักงานสรรพากรพื้นที่สาขาเมืองขอนแก่น 1"},
{"10400011","สำนักงานสรรพากรพื้นที่สาขาเมืองขอนแก่น 2"},
{"10400020","สำนักงานสรรพากรพื้นที่สาขาบ้านฝาง"},
{"10400030","สำนักงานสรรพากรพื้นที่สาขาพระยืน"},
{"10400040","สำนักงานสรรพากรพื้นที่สาขาหนองเรือ"},
{"10400050","สำนักงานสรรพากรพื้นที่สาขาชุมแพ"},
{"10400060","สำนักงานสรรพากรพื้นที่สาขาสีชมพู"},
{"10400070","สำนักงานสรรพากรพื้นที่สาขาน้ำพอง"},
{"10400080","สำนักงานสรรพากรพื้นที่สาขาอุบลรัตน์"},
{"10400090","สำนักงานสรรพากรพื้นที่สาขากระนวน"},
{"10400100","สำนักงานสรรพากรพื้นที่สาขาบ้านไผ่"},
{"10400120","สำนักงานสรรพากรพื้นที่สาขาพล"},
{"10400130","สำนักงานสรรพากรพื้นที่สาขาแวงใหญ่"},
{"10400140","สำนักงานสรรพากรพื้นที่สาขาแวงน้อย"},
{"10400150","สำนักงานสรรพากรพื้นที่สาขาหนองสองห้อง"},
{"10400160","สำนักงานสรรพากรพื้นที่สาขาภูเวียง"},
{"10400170","สำนักงานสรรพากรพื้นที่สาขามัญจาคีรี"},
{"10400180","สำนักงานสรรพากรพื้นที่สาขาชนบท"},
{"10400190","สำนักงานสรรพากรพื้นที่สาขาเขาสวนกวาง"},
{"10400200","สำนักงานสรรพากรพื้นที่สาขาภูผาม่าน"},
{"10400240","สำนักงานสรรพากรพื้นที่สาขาบ้านแฮด"},
{"10410000","สำนักงานสรรพากรพื้นที่อุดรธานี"},
{"10410010","สำนักงานสรรพากรพื้นที่สาขาเมืองอุดรธานี"},
{"10410020","สำนักงานสรรพากรพื้นที่สาขากุดจับ"},
{"10410030","สำนักงานสรรพากรพื้นที่สาขาหนองวัวซอ"},
{"10410040","สำนักงานสรรพากรพื้นที่สาขากุมภวาปี"},
{"10410050","สำนักงานสรรพากรพื้นที่สาขาโนนสะอาด"},
{"10410060","สำนักงานสรรพากรพื้นที่สาขาหนองหาน"},
{"10410070","สำนักงานสรรพากรพื้นที่สาขาทุ่งฝน"},
{"10410080","สำนักงานสรรพากรพื้นที่สาขาไชยวาน"},
{"10410090","สำนักงานสรรพากรพื้นที่สาขาศรีธาตุ"},
{"10410100","สำนักงานสรรพากรพื้นที่สาขาวังสามหมอ"},
{"10410110","สำนักงานสรรพากรพื้นที่สาขาบ้านดุง"},
{"10410170","สำนักงานสรรพากรพื้นที่สาขาบ้านผือ"},
{"10410180","สำนักงานสรรพากรพื้นที่สาขาน้ำโสม"},
{"10410190","สำนักงานสรรพากรพื้นที่สาขาเพ็ญ"},
{"10410200","สำนักงานสรรพากรพื้นที่สาขาสร้างคอม"},
{"10410210","สำนักงานสรรพากรพื้นที่สาขาหนองแสง"},
{"10410220","สำนักงานสรรพากรพื้นที่สาขานายูง"},
{"10420000","สำนักงานสรรพากรพื้นที่เลย"},
{"10420010","สำนักงานสรรพากรพื้นที่สาขาเมืองเลย"},
{"10420030","สำนักงานสรรพากรพื้นที่สาขาเชียงคาน"},
{"10420040","สำนักงานสรรพากรพื้นที่สาขาปากชม"},
{"10420050","สำนักงานสรรพากรพื้นที่สาขาด่านซ้าย"},
{"10420060","สำนักงานสรรพากรพื้นที่สาขานาแห้ว"},
{"10420070","สำนักงานสรรพากรพื้นที่สาขาภูเรือ"},
{"10420080","สำนักงานสรรพากรพื้นที่สาขาท่าลี่"},
{"10420090","สำนักงานสรรพากรพื้นที่สาขาวังสะพุง"},
{"10420100","สำนักงานสรรพากรพื้นที่สาขาภูกระดึง"},
{"10420120","สำนักงานสรรพากรพื้นที่สาขาผาขาว"},
{"10420130","สำนักงานสรรพากรพื้นที่สาขาเอราวัณ"},
{"10430000","สำนักงานสรรพากรพื้นที่หนองคาย"},
{"10430010","สำนักงานสรรพากรพื้นที่สาขาเมืองหนองคาย"},
{"10430020","สำนักงานสรรพากรพื้นที่สาขาท่าบ่อ"},
{"10430050","สำนักงานสรรพากรพื้นที่สาขาโพนพิสัย"},
{"10430070","สำนักงานสรรพากรพื้นที่สาขาศรีเชียงใหม่"},
{"10430080","สำนักงานสรรพากรพื้นที่สาขาสังคม"},
{"10430150","สำนักงานสรรพากรพื้นที่สาขาเฝ้าไร่"},
{"10430160","สำนักงานสรรพากรพื้นที่สาขารัตนวาปี"},
{"10440000","สำนักงานสรรพากรพื้นที่มหาสารคาม"},
{"10440010","สำนักงานสรรพากรพื้นที่สาขาเมืองมหาสารคาม"},
{"10440020","สำนักงานสรรพากรพื้นที่สาขาแกดำ"},
{"10440030","สำนักงานสรรพากรพื้นที่สาขาโกสุมพิสัย"},
{"10440040","สำนักงานสรรพากรพื้นที่สาขากันทรวิชัย"},
{"10440050","สำนักงานสรรพากรพื้นที่สาขาเชียงยืน"},
{"10440060","สำนักงานสรรพากรพื้นที่สาขาบรบือ"},
{"10440070","สำนักงานสรรพากรพื้นที่สาขานาเชือก"},
{"10440080","สำนักงานสรรพากรพื้นที่สาขาพยัคฆภูมิพิสัย"},
{"10440090","สำนักงานสรรพากรพื้นที่สาขาวาปีปทุม"},
{"10440100","สำนักงานสรรพากรพื้นที่สาขานาดูน"},
{"10440110","สำนักงานสรรพากรพื้นที่สาขายางสีสุราช"},
{"10440120","สำนักงานสรรพากรพื้นที่สาขากุดรัง"},
{"10450000","สำนักงานสรรพากรพื้นที่ร้อยเอ็ด"},
{"10450010","สำนักงานสรรพากรพื้นที่สาขาเมืองร้อยเอ็ด"},
{"10450020","สำนักงานสรรพากรพื้นที่สาขาเกษตรวิสัย"},
{"10450030","สำนักงานสรรพากรพื้นที่สาขาปทุมรัตต์"},
{"10450040","สำนักงานสรรพากรพื้นที่สาขาจตุรพักตรพิมาน"},
{"10450050","สำนักงานสรรพากรพื้นที่สาขาธวัชบุรี"},
{"10450060","สำนักงานสรรพากรพื้นที่สาขาพนมไพร"},
{"10450070","สำนักงานสรรพากรพื้นที่สาขาโพนทอง"},
{"10450080","สำนักงานสรรพากรพื้นที่สาขาโพธิ์ชัย"},
{"10450090","สำนักงานสรรพากรพื้นที่สาขาหนองพอก"},
{"10450100","สำนักงานสรรพากรพื้นที่สาขาเสลภูมิ"},
{"10450110","สำนักงานสรรพากรพื้นที่สาขาสุวรรณภูมิ"},
{"10450120","สำนักงานสรรพากรพื้นที่สาขาเมืองสรวง"},
{"10450130","สำนักงานสรรพากรพื้นที่สาขาโพนทราย"},
{"10450140","สำนักงานสรรพากรพื้นที่สาขาอาจสามารถ"},
{"10450150","สำนักงานสรรพากรพื้นที่สาขาเมยวดี"},
{"10450160","สำนักงานสรรพากรพื้นที่สาขาศรีสมเด็จ"},
{"10450170","สำนักงานสรรพากรพื้นที่สาขาจังหาร"},
{"10460000","สำนักงานสรรพากรพื้นที่กาฬสินธุ์"},
{"10460010","สำนักงานสรรพากรพื้นที่สาขาเมืองกาฬสินธุ์"},
{"10460030","สำนักงานสรรพากรพื้นที่สาขากมลาไสย"},
{"10460040","สำนักงานสรรพากรพื้นที่สาขาร่องคำ"},
{"10460050","สำนักงานสรรพากรพื้นที่สาขากุฉินารายณ์"},
{"10460060","สำนักงานสรรพากรพื้นที่สาขาเขาวง"},
{"10460070","สำนักงานสรรพากรพื้นที่สาขายางตลาด"},
{"10460080","สำนักงานสรรพากรพื้นที่สาขาห้วยเม็ก"},
{"10460090","สำนักงานสรรพากรพื้นที่สาขาสหัสขันธ์"},
{"10460100","สำนักงานสรรพากรพื้นที่สาขาคำม่วง"},
{"10460120","สำนักงานสรรพากรพื้นที่สาขาหนองกุงศรี"},
{"10460130","สำนักงานสรรพากรพื้นที่สาขาสมเด็จ"},
{"10460140","สำนักงานสรรพากรพื้นที่สาขาห้วยผึ้ง"},
{"10460160","สำนักงานสรรพากรพื้นที่สาขานาคู"},
{"10470000","สำนักงานสรรพากรพื้นที่สกลนคร"},
{"10470010","สำนักงานสรรพากรพื้นที่สาขาเมืองสกลนคร"},
{"10470020","สำนักงานสรรพากรพื้นที่สาขากุสุมาลย์"},
{"10470040","สำนักงานสรรพากรพื้นที่สาขาพรรณานิคม"},
{"10470050","สำนักงานสรรพากรพื้นที่สาขาพังโคน"},
{"10470060","สำนักงานสรรพากรพื้นที่สาขาวาริชภูมิ"},
{"10470080","สำนักงานสรรพากรพื้นที่สาขาวานรนิวาส"},
{"10470090","สำนักงานสรรพากรพื้นที่สาขาคำตากล้า"},
{"10470100","สำนักงานสรรพากรพื้นที่สาขาบ้านม่วง"},
{"10470110","สำนักงานสรรพากรพื้นที่สาขาอากาศอำนวย"},
{"10470120","สำนักงานสรรพากรพื้นที่สาขาสว่างแดนดิน"},
{"10470130","สำนักงานสรรพากรพื้นที่สาขาส่องดาว"},
{"10470140","สำนักงานสรรพากรพื้นที่สาขาเต่างอย"},
{"10470150","สำนักงานสรรพากรพื้นที่สาขาโคกศรีสุพรรณ"},
{"10470160","สำนักงานสรรพากรพื้นที่สาขาเจริญศิลป์"},
{"10470170","สำนักงานสรรพากรพื้นที่สาขาโพนนาแก้ว "},
{"10470180","สำนักงานสรรพากรพื้นที่สาขาภูพาน"},
{"10480000","สำนักงานสรรพากรพื้นที่นครพนม"},
{"10480010","สำนักงานสรรพากรพื้นที่สาขาเมืองนครพนม"},
{"10480020","สำนักงานสรรพากรพื้นที่สาขาปลาปาก"},
{"10480030","สำนักงานสรรพากรพื้นที่สาขาท่าอุเทน"},
{"10480040","สำนักงานสรรพากรพื้นที่สาขาบ้านแพง"},
{"10480050","สำนักงานสรรพากรพื้นที่สาขาธาตุพนม"},
{"10480060","สำนักงานสรรพากรพื้นที่สาขาเรณูนคร"},
{"10480070","สำนักงานสรรพากรพื้นที่สาขานาแก"},
{"10480080","สำนักงานสรรพากรพื้นที่สาขาศรีสงคราม"},
{"10480090","สำนักงานสรรพากรพื้นที่สาขานาหว้า"},
{"10480100","สำนักงานสรรพากรพื้นที่สาขาโพนสวรรค์"},
{"10490000","สำนักงานสรรพากรพื้นที่มุกดาหาร"},
{"10490010","สำนักงานสรรพากรพื้นที่สาขาเมืองมุกดาหาร"},
{"10490020","สำนักงานสรรพากรพื้นที่สาขานิคมคำสร้อย"},
{"10490030","สำนักงานสรรพากรพื้นที่สาขาดอนตาล"},
{"10490050","สำนักงานสรรพากรพื้นที่สาขาคำชะอี"},
{"10490070","สำนักงานสรรพากรพื้นที่สาขาหนองสูง"},
{"11000000","สำนักงานสรรพากรภาค 11"},
{"11800000","สำนักงานสรรพากรพื้นที่นครศรีธรรมราช"},
{"11800010","สำนักงานสรรพากรพื้นที่สาขาเมืองนครศรีธรรมราช"},
{"11800020","สำนักงานสรรพากรพื้นที่สาขาพรหมคีรี"},
{"11800030","สำนักงานสรรพากรพื้นที่สาขาลานสกา"},
{"11800040","สำนักงานสรรพากรพื้นที่สาขาฉวาง"},
{"11800050","สำนักงานสรรพากรพื้นที่สาขาพิปูน"},
{"11800060","สำนักงานสรรพากรพื้นที่สาขาเชียรใหญ่"},
{"11800070","สำนักงานสรรพากรพื้นที่สาขาชะอวด"},
{"11800080","สำนักงานสรรพากรพื้นที่สาขาท่าศาลา"},
{"11800090","สำนักงานสรรพากรพื้นที่สาขาทุ่งสง"},
{"11800100","สำนักงานสรรพากรพื้นที่สาขานาบอน"},
{"11800110","สำนักงานสรรพากรพื้นที่สาขาทุ่งใหญ่"},
{"11800120","สำนักงานสรรพากรพื้นที่สาขาปากพนัง"},
{"11800130","สำนักงานสรรพากรพื้นที่สาขาร่อนพิบูลย์"},
{"11800140","สำนักงานสรรพากรพื้นที่สาขาสิชล"},
{"11800150","สำนักงานสรรพากรพื้นที่สาขาขนอม"},
{"11800160","สำนักงานสรรพากรพื้นที่สาขาหัวไทร"},
{"11800180","สำนักงานสรรพากรพื้นที่สาขาถ้ำพรรณรา"},
{"11800190","สำนักงานสรรพากรพื้นที่สาขาจุฬาภรณ์"},
{"11800200","สำนักงานสรรพากรพื้นที่สาขาพระพรหม"},
{"11800220","สำนักงานสรรพากรพื้นที่สาขาช้างกลาง"},
{"11800230","สำนักงานสรรพากรพื้นที่สาขาเฉลิมพระเกียรติ (นศ.)"},
{"11810000","สำนักงานสรรพากรพื้นที่กระบี่"},
{"11810010","สำนักงานสรรพากรพื้นที่สาขาเมืองกระบี่"},
{"11810020","สำนักงานสรรพากรพื้นที่สาขาเขาพนม"},
{"11810030","สำนักงานสรรพากรพื้นที่สาขาเกาะลันตา"},
{"11810040","สำนักงานสรรพากรพื้นที่สาขาคลองท่อม"},
{"11810050","สำนักงานสรรพากรพื้นที่สาขาอ่าวลึก"},
{"11810060","สำนักงานสรรพากรพื้นที่สาขาปลายพระยา"},
{"11810080","สำนักงานสรรพากรพื้นที่สาขาเหนือคลอง "},
{"11820000","สำนักงานสรรพากรพื้นที่พังงา"},
{"11820010","สำนักงานสรรพากรพื้นที่สาขาเมืองพังงา"},
{"11820020","สำนักงานสรรพากรพื้นที่สาขาเกาะยาว"},
{"11820030","สำนักงานสรรพากรพื้นที่สาขากะปง"},
{"11820040","สำนักงานสรรพากรพื้นที่สาขาตะกั่วทุ่ง"},
{"11820050","สำนักงานสรรพากรพื้นที่สาขาตะกั่วป่า"},
{"11820060","สำนักงานสรรพากรพื้นที่สาขาคุระบุรี"},
{"11820070","สำนักงานสรรพากรพื้นที่สาขาทับปุด"},
{"11820080","สำนักงานสรรพากรพื้นที่สาขาท้ายเหมือง"},
{"11830000","สำนักงานสรรพากรพื้นที่ภูเก็ต"},
{"11830010","สำนักงานสรรพากรพื้นที่สาขาเมืองภูเก็ต 1"},
{"11830011","สำนักงานสรรพากรพื้นที่สาขาเมืองภูเก็ต 2"},
{"11830020","สำนักงานสรรพากรพื้นที่สาขากะทู้"},
{"11830030","สำนักงานสรรพากรพื้นที่สาขาถลาง"},
{"11840000","สำนักงานสรรพากรพื้นที่สุราษฎร์ธานี 1"},
{"11840010","สำนักงานสรรพากรพื้นที่สาขาเมืองสุราษฎร์ธานี"},
{"11840020","สำนักงานสรรพากรพื้นที่สาขากาญจนดิษฐ์"},
{"11840030","สำนักงานสรรพากรพื้นที่สาขาดอนสัก"},
{"11840060","สำนักงานสรรพากรพื้นที่สาขาไชยา"},
{"11840070","สำนักงานสรรพากรพื้นที่สาขาท่าชนะ"},
{"11840080","สำนักงานสรรพากรพื้นที่สาขาคีรีรัฐนิคม"},
{"11840090","สำนักงานสรรพากรพื้นที่สาขาบ้านตาขุน"},
{"11840100","สำนักงานสรรพากรพื้นที่สาขาพนม"},
{"11840110","สำนักงานสรรพากรพื้นที่สาขาท่าฉาง"},
{"11840120","สำนักงานสรรพากรพื้นที่สาขาบ้านนาสาร"},
{"11840130","สำนักงานสรรพากรพื้นที่สาขาบ้านนาเดิม"},
{"11840140","สำนักงานสรรพากรพื้นที่สาขาเคียนซา"},
{"11840150","สำนักงานสรรพากรพื้นที่สาขาเวียงสระ"},
{"11840160","สำนักงานสรรพากรพื้นที่สาขาพระแสง"},
{"11840170","สำนักงานสรรพากรพื้นที่สาขาพุนพิน"},
{"11840180","สำนักงานสรรพากรพื้นที่สาขาชัยบุรี"},
{"11841000","สำนักงานสรรพากรพื้นที่สุราษฎร์ธานี 2 "},
{"11841040","สำนักงานสรรพากรพื้นที่สาขาเกาะสมุย"},
{"11841050","สำนักงานสรรพากรพื้นที่สาขาเกาะพะงัน"},
{"11850000","สำนักงานสรรพากรพื้นที่ระนอง"},
{"11850010","สำนักงานสรรพากรพื้นที่สาขาเมืองระนอง"},
{"11850020","สำนักงานสรรพากรพื้นที่สาขาละอุ่น"},
{"11850030","สำนักงานสรรพากรพื้นที่สาขากะเปอร์"},
{"11850040","สำนักงานสรรพากรพื้นที่สาขากระบุรี"},
{"11860000","สำนักงานสรรพากรพื้นที่ชุมพร"},
{"11860010","สำนักงานสรรพากรพื้นที่สาขาเมืองชุมพร"},
{"11860020","สำนักงานสรรพากรพื้นที่สาขาท่าแซะ"},
{"11860030","สำนักงานสรรพากรพื้นที่สาขาปะทิว"},
{"11860040","สำนักงานสรรพากรพื้นที่สาขาหลังสวน"},
{"11860050","สำนักงานสรรพากรพื้นที่สาขาละแม"},
{"11860060","สำนักงานสรรพากรพื้นที่สาขาพะโต๊ะ"},
{"11860070","สำนักงานสรรพากรพื้นที่สาขาสวี"},
{"11860080","สำนักงานสรรพากรพื้นที่สาขาทุ่งตะโก"},
{"12000000","สำนักงานสรรพากรภาค 12"},
{"12900000","สำนักงานสรรพากรพื้นที่สงขลา 1"},
{"12900010","สำนักงานสรรพากรพื้นที่สาขาเมืองสงขลา"},
{"12900020","สำนักงานสรรพากรพื้นที่สาขาสทิงพระ"},
{"12900030","สำนักงานสรรพากรพื้นที่สาขาจะนะ"},
{"12900040","สำนักงานสรรพากรพื้นที่สาขานาทวี"},
{"12900050","สำนักงานสรรพากรพื้นที่สาขาเทพา"},
{"12900060","สำนักงานสรรพากรพื้นที่สาขาสะบ้าย้อย"},
{"12900070","สำนักงานสรรพากรพื้นที่สาขาระโนด"},
{"12900100","สำนักงานสรรพากรพื้นที่สาขาสะเดา"},
{"12900150","สำนักงานสรรพากรพื้นที่สาขาสิงหนคร"},
{"12901000","สำนักงานสรรพากรพื้นที่สงขลา 2"},
{"12901090","สำนักงานสรรพากรพื้นที่สาขารัตภูมิ"},
{"12901110","สำนักงานสรรพากรพื้นที่สาขาหาดใหญ่ 1"},
{"12901111","สำนักงานสรรพากรพื้นที่สาขาหาดใหญ่ 2"},
{"12901120","สำนักงานสรรพากรพื้นที่สาขานาหม่อม"},
{"12901130","สำนักงานสรรพากรพื้นที่สาขาควนเนียง"},
{"12901140","สำนักงานสรรพากรพื้นที่สาขาบางกล่ำ"},
{"12901160","สำนักงานสรรพากรพื้นที่สาขาคลองหอยโข่ง "},
{"12910000","สำนักงานสรรพากรพื้นที่สตูล"},
{"12910010","สำนักงานสรรพากรพื้นที่สาขาเมืองสตูล"},
{"12910020","สำนักงานสรรพากรพื้นที่สาขาควนโดน"},
{"12910030","สำนักงานสรรพากรพื้นที่สาขาควนกาหลง"},
{"12910040","สำนักงานสรรพากรพื้นที่สาขาท่าแพ"},
{"12910050","สำนักงานสรรพากรพื้นที่สาขาละงู"},
{"12910060","สำนักงานสรรพากรพื้นที่สาขาทุ่งหว้า"},
{"12920000","สำนักงานสรรพากรพื้นที่ตรัง"},
{"12920010","สำนักงานสรรพากรพื้นที่สาขาเมืองตรัง"},
{"12920020","สำนักงานสรรพากรพื้นที่สาขากันตัง"},
{"12920030","สำนักงานสรรพากรพื้นที่สาขาย่านตาขาว"},
{"12920040","สำนักงานสรรพากรพื้นที่สาขาปะเหลียน"},
{"12920050","สำนักงานสรรพากรพื้นที่สาขาสิเกา"},
{"12920060","สำนักงานสรรพากรพื้นที่สาขาห้วยยอด"},
{"12920070","สำนักงานสรรพากรพื้นที่สาขาวังวิเศษ"},
{"12920080","สำนักงานสรรพากรพื้นที่สาขานาโยง"},
{"12920090","สำนักงานสรรพากรพื้นที่สาขารัษฎา  "},
{"12930000","สำนักงานสรรพากรพื้นที่พัทลุง"},
{"12930010","สำนักงานสรรพากรพื้นที่สาขาเมืองพัทลุง"},
{"12930030","สำนักงานสรรพากรพื้นที่สาขาเขาชัยสน"},
{"12930040","สำนักงานสรรพากรพื้นที่สาขาตะโหมด"},
{"12930050","สำนักงานสรรพากรพื้นที่สาขาควนขนุน"},
{"12930060","สำนักงานสรรพากรพื้นที่สาขาปากพะยูน"},
{"12930070","สำนักงานสรรพากรพื้นที่สาขาศรีบรรพต"},
{"12930080","สำนักงานสรรพากรพื้นที่สาขาป่าบอน"},
{"12930090","สำนักงานสรรพากรพื้นที่สาขาบางแก้ว"},
{"12930100","สำนักงานสรรพากรพื้นที่สาขาป่าพะยอม"},
{"12940000","สำนักงานสรรพากรพื้นที่ปัตตานี"},
{"12940010","สำนักงานสรรพากรพื้นที่สาขาเมืองปัตตานี"},
{"12940020","สำนักงานสรรพากรพื้นที่สาขาโคกโพธิ์"},
{"12940030","สำนักงานสรรพากรพื้นที่สาขาหนองจิก"},
{"12940040","สำนักงานสรรพากรพื้นที่สาขาปะนาเระ"},
{"12940050","สำนักงานสรรพากรพื้นที่สาขามายอ"},
{"12940060","สำนักงานสรรพากรพื้นที่สาขาทุ่งยางแดง"},
{"12940070","สำนักงานสรรพากรพื้นที่สาขาสายบุรี"},
{"12940080","สำนักงานสรรพากรพื้นที่สาขาไม้แก่น"},
{"12940090","สำนักงานสรรพากรพื้นที่สาขายะหริ่ง"},
{"12940100","สำนักงานสรรพากรพื้นที่สาขายะรัง"},
{"12940110","สำนักงานสรรพากรพื้นที่สาขากะพ้อ"},
{"12940120","สำนักงานสรรพากรพื้นที่สาขาแม่ลาน"},
{"12950000","สำนักงานสรรพากรพื้นที่ยะลา"},
{"12950010","สำนักงานสรรพากรพื้นที่สาขาเมืองยะลา"},
{"12950020","สำนักงานสรรพากรพื้นที่สาขาเบตง"},
{"12950030","สำนักงานสรรพากรพื้นที่สาขาบันนังสตา"},
{"12950040","สำนักงานสรรพากรพื้นที่สาขาธารโต"},
{"12950050","สำนักงานสรรพากรพื้นที่สาขายะหา"},
{"12950060","สำนักงานสรรพากรพื้นที่สาขารามัน"},
{"12950070","สำนักงานสรรพากรพื้นที่สาขากาบัง"},
{"12960000","สำนักงานสรรพากรพื้นที่นราธิวาส"},
{"12960010","สำนักงานสรรพากรพื้นที่สาขาเมืองนราธิวาส"},
{"12960020","สำนักงานสรรพากรพื้นที่สาขาตากใบ"},
{"12960030","สำนักงานสรรพากรพื้นที่สาขาบาเจาะ"},
{"12960040","สำนักงานสรรพากรพื้นที่สาขายี่งอ"},
{"12960050","สำนักงานสรรพากรพื้นที่สาขาระแงะ"},
{"12960060","สำนักงานสรรพากรพื้นที่สาขารือเสาะ"},
{"12960070","สำนักงานสรรพากรพื้นที่สาขาศรีสาคร"},
{"12960080","สำนักงานสรรพากรพื้นที่สาขาแว้ง"},
{"12960090","สำนักงานสรรพากรพื้นที่สาขาสุคิริน"},
{"12960100","สำนักงานสรรพากรพื้นที่สาขาสุไหงโก-ลก"},
{"12960110","สำนักงานสรรพากรพื้นที่สาขาสุไหงปาดี"},
{"12960120","สำนักงานสรรพากรพื้นที่สาขาจะแนะ"},
{"12960130","สำนักงานสรรพากรพื้นที่สาขาเจาะไอร้อง"}
            };
            foreach (KeyValuePair<string, string> pair in office)
            {
                Office theObject = ObjectSpace.FindObject<Office>(CriteriaOperator.Parse("OfficeId=?", pair.Key));
                if (theObject == null)
                {
                    theObject = ObjectSpace.CreateObject<Office>();
                    theObject.OfficeId = pair.Key;
                    theObject.OfficeName = pair.Value;
                }
            }

            string[] ufp = { "ร้อยละ", "ระดับ", "ราย", "ราย/แบบ" };
            foreach (string u in ufp)
            {
                UnitOfPoint obj = ObjectSpace.FindObject<UnitOfPoint>(CriteriaOperator.Parse("Title=?", u));
                if(obj == null)
                {
                    obj = ObjectSpace.CreateObject<UnitOfPoint>();
                    obj.Title = u;
                    obj.Save();
                }
            }

            Dimension dimension = ObjectSpace.FindObject<Dimension>(CriteriaOperator.Parse("Title=?", "มิติภายนอก"));
            if (dimension == null)
            {
                dimension = ObjectSpace.CreateObject<Dimension>();
                dimension.Title = "มิติภายนอก";
                dimension.Save();
            }

            Dimension dimensionI = ObjectSpace.FindObject<Dimension>(CriteriaOperator.Parse("Title=?", "มิติภายใน"));
            if (dimensionI == null)
            {
                dimensionI = ObjectSpace.CreateObject<Dimension>();
                dimensionI.Title = "มิติภายใน";
                dimensionI.Save();
            }

            Evaluation evaluation = ObjectSpace.FindObject<Evaluation>(CriteriaOperator.Parse("Title=?", "การประเมินประสิทธิผลและการประเมินคุณภาพ"));
            if (evaluation == null)
            {
                evaluation = ObjectSpace.CreateObject<Evaluation>();
                evaluation.Title = "การประเมินประสิทธิผลและการประเมินคุณภาพ";
                evaluation.Dimension = dimension;
            }

            Evaluation evaluationI = ObjectSpace.FindObject<Evaluation>(CriteriaOperator.Parse("Title=?", "การประเมินประสิทธิภาพและการพัฒนาองค์การ"));
            if (evaluationI == null)
            {
                evaluationI = ObjectSpace.CreateObject<Evaluation>();
                evaluationI.Title = "การประเมินประสิทธิภาพและการพัฒนาองค์การ";
                evaluationI.Dimension = dimensionI;
            }

            //EvaluationRound r = ObjectSpace.FindObject<EvaluationRound>(CriteriaOperator.Parse("Year=?", DateTime.Now.Year + 543));
            //if (r == null)
            //{
            //    r = ObjectSpace.CreateObject<EvaluationRound>();
            //    r.Year = DateTime.Now.Year+543;
            //    r.VRound = 1;
            //}

            Employee userAdmin = ObjectSpace.FindObject<Employee>(new BinaryOperator("UserName", "Admin"));
            if(userAdmin == null) {
                userAdmin = ObjectSpace.CreateObject<Employee>();
                userAdmin.UserName = "admin";
                userAdmin.FirstName = "ผู้ดูแลระบบ";
                userAdmin.LastName = "ผษ.";
                Office of = ObjectSpace.FindObject<Office>(new BinaryOperator("OfficeName", "กองวิชาการแผนภาษี"));
                userAdmin.Office = of;
                // Set a password if the standard authentication type is used
                userAdmin.SetPassword("");
            }
			// If a role with the Administrators name doesn't exist in the database, create this role
            PermissionPolicyRole adminRole = ObjectSpace.FindObject<PermissionPolicyRole>(new BinaryOperator("Name", "Administrators"));
            if(adminRole == null) {
                adminRole = ObjectSpace.CreateObject<PermissionPolicyRole>();
                adminRole.Name = "Administrators";
            }
            adminRole.IsAdministrative = true;
            //adminRole.AddNavigationPermission(@"Application/NavigationItems/Items/Default/Items/OwnResult_ListView", SecurityPermissionState.Deny);
            userAdmin.Roles.Add(adminRole);
            ObjectSpace.CommitChanges(); //This line persists created object(s).
        }
        // End---------------------------Create Database Initialization

        public override void UpdateDatabaseBeforeUpdateSchema() {
            base.UpdateDatabaseBeforeUpdateSchema();
        }

        private PermissionPolicyRole CreateDefaultRole() {
            PermissionPolicyRole defaultRole = ObjectSpace.FindObject<PermissionPolicyRole>(new BinaryOperator("Name", "Default"));
            if(defaultRole == null) {
                defaultRole = ObjectSpace.CreateObject<PermissionPolicyRole>();
                defaultRole.Name = "Default";
                defaultRole.IsAdministrative = false;


                defaultRole.AddTypePermission<MediaDataObject>(SecurityOperations.FullAccess, SecurityPermissionState.Allow);

                defaultRole.AddTypePermission<PermissionPolicyRole>(SecurityOperations.Read, SecurityPermissionState.Allow);

                defaultRole.AddObjectPermission<Employee>(SecurityOperations.FullObjectAccess, "[Oid] = CurrentUserId()", SecurityPermissionState.Allow);
                defaultRole.AddMemberPermission<Employee>(SecurityOperations.Write, "ChangePasswordOnFirstLogon", "[Oid] = CurrentUserId()", SecurityPermissionState.Deny);
                defaultRole.AddMemberPermission<Employee>(SecurityOperations.Write, "StoredPassword", "[Oid] = CurrentUserId()", SecurityPermissionState.Deny);
                defaultRole.AddMemberPermission<Employee>(SecurityOperations.Write, "IsActive", "[Oid] = CurrentUserId()", SecurityPermissionState.Deny);
                defaultRole.AddMemberPermission<Employee>(SecurityOperations.Write, "UserName", "[Oid] = CurrentUserId()", SecurityPermissionState.Deny);

                defaultRole.AddNavigationPermission(@"Application/NavigationItems/Items/User/Items/MyDetails", SecurityPermissionState.Allow);
                defaultRole.AddNavigationPermission(@"Application/NavigationItems/Items/Default/Items/Score_ListView", SecurityPermissionState.Allow);
                defaultRole.AddNavigationPermission(@"Application/NavigationItems/Items/Audit/Items/AuditScore_ListView", SecurityPermissionState.Allow);

                defaultRole.AddTypePermission<Score>(SecurityOperations.Read, SecurityPermissionState.Allow);
                defaultRole.AddObjectPermission<Score>(SecurityOperations.FullObjectAccess, "Owner.Oid = CurrentUserId()", SecurityPermissionState.Allow);
                defaultRole.AddTypePermission<OwnScore>(SecurityOperations.Read, SecurityPermissionState.Allow);
                defaultRole.AddObjectPermission<OwnScore>(SecurityOperations.FullObjectAccess, "Owner.Oid = CurrentUserId()", SecurityPermissionState.Allow);

                defaultRole.AddTypePermission<AuditScore>(SecurityOperations.Read, SecurityPermissionState.Allow);  
                defaultRole.AddTypePermission<Dimension>(SecurityOperations.Read, SecurityPermissionState.Allow);
                defaultRole.AddTypePermission<Evaluation>(SecurityOperations.Read, SecurityPermissionState.Allow);
                defaultRole.AddTypePermission<EvaluationRound>(SecurityOperations.Read, SecurityPermissionState.Allow);
                defaultRole.AddTypePermission<Office>(SecurityOperations.Read, SecurityPermissionState.Allow);
                defaultRole.AddTypePermission<OpenSendScore>(SecurityOperations.Read, SecurityPermissionState.Allow);
                defaultRole.AddTypePermission<PointOfEvaluation>(SecurityOperations.Read, SecurityPermissionState.Allow);
                defaultRole.AddTypePermission<SubPointOfEvaluation>(SecurityOperations.Read, SecurityPermissionState.Allow);
                defaultRole.AddTypePermission<UnitOfPoint>(SecurityOperations.Read, SecurityPermissionState.Allow);
            }
            return defaultRole;
        }
        private PermissionPolicyRole CreateDataEntryRole()
        {
            PermissionPolicyRole defaultRole = ObjectSpace.FindObject<PermissionPolicyRole>(new BinaryOperator("Name", "Data Entry"));
            if (defaultRole == null)
            {
                defaultRole = ObjectSpace.CreateObject<PermissionPolicyRole>();
                defaultRole.Name = "Data Entry";
                defaultRole.IsAdministrative = false;


                defaultRole.AddTypePermission<MediaDataObject>(SecurityOperations.FullAccess, SecurityPermissionState.Allow);

                defaultRole.AddTypePermission<PermissionPolicyRole>(SecurityOperations.Read, SecurityPermissionState.Allow);

                defaultRole.AddObjectPermission<Employee>(SecurityOperations.FullObjectAccess, "[Oid] = CurrentUserId()", SecurityPermissionState.Allow);
                defaultRole.AddMemberPermission<Employee>(SecurityOperations.Write, "ChangePasswordOnFirstLogon", "[Oid] = CurrentUserId()", SecurityPermissionState.Deny);
                defaultRole.AddMemberPermission<Employee>(SecurityOperations.Write, "StoredPassword", "[Oid] = CurrentUserId()", SecurityPermissionState.Deny);
                defaultRole.AddMemberPermission<Employee>(SecurityOperations.Write, "IsActive", "[Oid] = CurrentUserId()", SecurityPermissionState.Deny);
                defaultRole.AddMemberPermission<Employee>(SecurityOperations.Write, "UserName", "[Oid] = CurrentUserId()", SecurityPermissionState.Deny);

                defaultRole.AddNavigationPermission(@"Application/NavigationItems/Items/User/Items/MyDetails", SecurityPermissionState.Allow);
                defaultRole.AddNavigationPermission(@"Application/NavigationItems/Items/Default/Items/Score_ListView", SecurityPermissionState.Allow);
                defaultRole.AddNavigationPermission(@"Application/NavigationItems/Items/Audit/Items/AuditScore_ListView", SecurityPermissionState.Allow);

                defaultRole.AddTypePermission<Score>(SecurityOperations.Read, SecurityPermissionState.Allow);
                defaultRole.AddObjectPermission<Score>(SecurityOperations.FullObjectAccess, "Owner.Oid = CurrentUserId() or Office.OfficeId = [<Employee>][Oid = CurrentUserId()][Office][OfficeId]", SecurityPermissionState.Allow);

                defaultRole.AddTypePermission<OwnScore>(SecurityOperations.Read, SecurityPermissionState.Allow);
                defaultRole.AddObjectPermission<OwnScore>(SecurityOperations.FullObjectAccess, "Owner.Oid = CurrentUserId() or Office.OfficeId = [<Employee>][Oid = CurrentUserId()][Office][OfficeId]", SecurityPermissionState.Allow);

                defaultRole.AddTypePermission<AuditScore>(SecurityOperations.Read, SecurityPermissionState.Allow);
                defaultRole.AddTypePermission<Dimension>(SecurityOperations.Read, SecurityPermissionState.Allow);
                defaultRole.AddTypePermission<Evaluation>(SecurityOperations.Read, SecurityPermissionState.Allow);
                defaultRole.AddTypePermission<EvaluationRound>(SecurityOperations.Read, SecurityPermissionState.Allow);
                defaultRole.AddTypePermission<Office>(SecurityOperations.Read, SecurityPermissionState.Allow);
                defaultRole.AddTypePermission<OpenSendScore>(SecurityOperations.Read, SecurityPermissionState.Allow);
                defaultRole.AddTypePermission<PointOfEvaluation>(SecurityOperations.Read, SecurityPermissionState.Allow);
                defaultRole.AddTypePermission<SubPointOfEvaluation>(SecurityOperations.Read, SecurityPermissionState.Allow);
                defaultRole.AddTypePermission<UnitOfPoint>(SecurityOperations.Read, SecurityPermissionState.Allow);
            }
            return defaultRole;
        }

        private PermissionPolicyRole CreateAuditRole()
        {
            PermissionPolicyRole defaultRole = ObjectSpace.FindObject<PermissionPolicyRole>(new BinaryOperator("Name", "Audit"));
            if (defaultRole == null)
            {
                defaultRole = ObjectSpace.CreateObject<PermissionPolicyRole>();
                defaultRole.Name = "Audit";
                defaultRole.IsAdministrative = false;


                defaultRole.AddTypePermission<MediaDataObject>(SecurityOperations.FullAccess, SecurityPermissionState.Allow);

                defaultRole.AddTypePermission<PermissionPolicyRole>(SecurityOperations.Read, SecurityPermissionState.Allow);

                defaultRole.AddObjectPermission<Employee>(SecurityOperations.FullObjectAccess, "[Oid] = CurrentUserId()", SecurityPermissionState.Allow);
                defaultRole.AddMemberPermission<Employee>(SecurityOperations.Write, "ChangePasswordOnFirstLogon", "[Oid] = CurrentUserId()", SecurityPermissionState.Deny);
                defaultRole.AddMemberPermission<Employee>(SecurityOperations.Write, "StoredPassword", "[Oid] = CurrentUserId()", SecurityPermissionState.Deny);
                defaultRole.AddMemberPermission<Employee>(SecurityOperations.Write, "IsActive", "[Oid] = CurrentUserId()", SecurityPermissionState.Deny);
                defaultRole.AddMemberPermission<Employee>(SecurityOperations.Write, "UserName", "[Oid] = CurrentUserId()", SecurityPermissionState.Deny);

                defaultRole.AddNavigationPermission(@"Application/NavigationItems/Items/User/Items/MyDetails", SecurityPermissionState.Allow);
                defaultRole.AddNavigationPermission(@"Application/NavigationItems/Items/Default/Items/Score_ListView", SecurityPermissionState.Allow);
                defaultRole.AddNavigationPermission(@"Application/NavigationItems/Items/Audit/Items/AuditScore_ListView", SecurityPermissionState.Allow);

                defaultRole.AddTypePermission<Score>(SecurityOperations.Read, SecurityPermissionState.Allow);
                defaultRole.AddObjectPermission<Score>(SecurityOperations.FullObjectAccess, "Owner.Oid = CurrentUserId() or Office.OfficeId = [<Employee>][Oid = CurrentUserId()][Office][OfficeId]", SecurityPermissionState.Allow);

                defaultRole.AddTypePermission<OwnScore>(SecurityOperations.Read, SecurityPermissionState.Allow);
                defaultRole.AddObjectPermission<OwnScore>(SecurityOperations.FullObjectAccess, "Owner.Oid = CurrentUserId() or Office.OfficeId = [<Employee>][Oid = CurrentUserId()][Office][OfficeId]", SecurityPermissionState.Allow);

                defaultRole.AddTypePermission<AuditScore>(SecurityOperations.Read, SecurityPermissionState.Allow);
                defaultRole.AddObjectPermission<AuditScore>(SecurityOperations.FullObjectAccess, "Owner.Oid = CurrentUserId() or OfficeAudit.OfficeId = [<Employee>][Oid = CurrentUserId()][Office][OfficeId]", SecurityPermissionState.Allow);

                defaultRole.AddTypePermission<Dimension>(SecurityOperations.Read, SecurityPermissionState.Allow);
                defaultRole.AddTypePermission<Evaluation>(SecurityOperations.Read, SecurityPermissionState.Allow);
                defaultRole.AddTypePermission<EvaluationRound>(SecurityOperations.Read, SecurityPermissionState.Allow);
                defaultRole.AddTypePermission<Office>(SecurityOperations.Read, SecurityPermissionState.Allow);
                defaultRole.AddTypePermission<OpenSendScore>(SecurityOperations.Read, SecurityPermissionState.Allow);
                defaultRole.AddTypePermission<PointOfEvaluation>(SecurityOperations.Read, SecurityPermissionState.Allow);
                defaultRole.AddTypePermission<SubPointOfEvaluation>(SecurityOperations.Read, SecurityPermissionState.Allow);
                defaultRole.AddTypePermission<UnitOfPoint>(SecurityOperations.Read, SecurityPermissionState.Allow);
            }
            return defaultRole;
        }
    }
}
